////////////////////////////////////////////////////////////////////////////////
// Серверные процедуры и функции, управляющие настройками системы (локализация)
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область Константы

// Дополняет значения констант в новой ИБ по умолчанию.
//
// Параметры:
// 	Результат - Структура - Дополняемая структура констант
//
Процедура ДополнитьЗначенияКонстантПоУмолчанию(Результат) Экспорт
	
	//++ Локализация
	БазоваяВерсия = СтандартныеПодсистемыСервер.ЭтоБазоваяВерсияКонфигурации();
	

#Область Начисление_Зарплаты
    Результат.Вставить(Метаданные.Константы.ИспользоватьНачислениеЗарплаты.Имя, Ложь); // в BAS УТ
	//++ НЕ УТ
	Результат.Вставить(Метаданные.Константы.ИспользоватьНачислениеЗарплаты.Имя, Истина);
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаИУправлениеПерсоналом") Тогда
		Результат.Вставить(Метаданные.Константы.СтруктураПредприятияНеСоответствуетСтруктуреЮридическихЛиц.Имя, Ложь);
		Результат.Вставить(Метаданные.Константы.ИнтерфейсБЗК.Имя, Истина);
	КонецЕсли;	
	//-- НЕ УТ
    
#КонецОбласти

	//-- Локализация
	
	Возврат
	
КонецПроцедуры

// Дополняет значения констант, контролируемых в базовой версии.
//
// Параметры:
// 	Результат - Структура - Дополняемая структура констант
//
Процедура ДополнитьЗначенияКонстантКонтролируемыхВБазовойВерсии(Результат) Экспорт 
	//++ Локализация
	Результат.Вставить(Метаданные.Константы.БазоваяВерсия.Имя, Истина);
	Результат.Вставить(Метаданные.Константы.НеБазоваяВерсия.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьАнкетирование.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьВерсионированиеОбъектов.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьВнешнихПользователей.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьГруппыПользователей.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьЗаметки.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьНапоминанияПользователя.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьНесколькоОрганизаций.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьПочтовыйКлиент.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьПризнакРассмотрено.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьУправлениеДоступом.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ИспользоватьУправленческуюОрганизацию.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.НезависимоеИспользованиеДополнительныхОтчетовИОбработокВМоделиСервиса.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ОграничиватьДоступНаУровнеЗаписей.Имя, Ложь);
	//++ НЕ УТ
	Результат.Вставить(Метаданные.Константы.ОграничиватьДоступНаУровнеЗаписейФизическиеЛица.Имя, Ложь);
	//-- НЕ УТ
	Результат.Вставить(Метаданные.Константы.СоздаватьЭлектронныеПодписиНаСервере.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.ЭтоАвтономноеРабочееМесто.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.НеИспользоватьРазделениеПоОбластямДанных.Имя, Истина);
	
	// Прочие начальные значения
	
	//-- Локализация
	Возврат
КонецПроцедуры

// Дополняет список констант, которые доступны для изменения в базовой версии.
//
// Параметры:
// 	Результат - Структура - Дополняемая структура констант
//
Процедура ДополнитьКонстантыДоступныеВБазовойВерсии(Результат) Экспорт 
	//++ Локализация
	//-- Локализация
	Возврат
КонецПроцедуры

// Дополняет значения констант контролируемых в НЕ базовой версии.
//
// Параметры:
// 	Результат - Структура - Дополняемая структура констант
//
Процедура ДополнитьЗначенияКонстантКонтролируемыхВНеБазовойВерсии(Результат) Экспорт 
	//++ Локализация
	Результат.Вставить(Метаданные.Константы.БазоваяВерсия.Имя, Ложь);
	Результат.Вставить(Метаданные.Константы.НеБазоваяВерсия.Имя, Истина);
	Результат.Вставить(Метаданные.Константы.ИспользоватьУправлениеДоступом.Имя, Истина);
	//-- Локализация
	Возврат
КонецПроцедуры

// Дополняет таблицу, описывающую зависимость констант в конфигурации.
// Каждая строка таблицы означает:
// для родительской константы со значением Х допустимо только значение Y для подчиненной константы.
// Параметры:
// 	Результат - ТаблицаЗначений - Дополняемая таблица констант
//
// Возвращаемое значение:
//	ТаблицаЗначений с колонками
//		- ИмяРодительскойКонстанты
//		- ИмяПодчиненнойКонстанты
//		- ЗначениеРодительскойКонстанты
//		- ЗначениеПодчиненнойКонстанты.
//
Процедура ДополнитьТаблицуЗависимостиКонстант(Результат) Экспорт
	//++ Локализация
	БазоваяВерсия = СтандартныеПодсистемыСервер.ЭтоБазоваяВерсияКонфигурации();


#Область Управление_доступом
	//++ НЕ УТ
	НастройкиСистемы.ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		Метаданные.Константы.ОграничиватьДоступНаУровнеЗаписей.Имя, Ложь,
		Метаданные.Константы.ОграничиватьДоступНаУровнеЗаписейФизическиеЛица.Имя, Ложь);
	//-- НЕ УТ
#КонецОбласти



	//-- Локализация
	Возврат
КонецПроцедуры

#КонецОбласти

#Область ПрочийПрограммныйИнтерфейс

// Устанавливает видимость групп элементов, относящихся к элементам локализации. 
// 
// Параметры:
// 	Форма - ФормаКлиентскогоПриложения - форма, в которой необходима установка видимости.
Процедура УстановитьВидимостьЭлементовЛокализации(Форма) Экспорт
	
    Возврат;
	
	Для Каждого ЭлементФормы Из Форма.Элементы Цикл
		Если ТипЗнч(ЭлементФормы) = тип("ГруппаФормы") 
			И СтрНачинаетсяС(ЭлементФормы.Имя, "Локализация") Тогда
			ЭлементФормы.Видимость = Ложь;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Позволяет переопределить код валюты по умолчанию.
//
// Параметры:    
//  КодВалюты	 - Строка - код валюты.
//
Процедура ПереопределитьКодВалютыПоУмолчанию(КодВалюты) Экспорт
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ИспользоватьОбменССайтом() Экспорт
	Результат = Ложь;
	Возврат Результат
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СинхронизироватьЗначенияПодчиненныхКонстант(ИмяКонстанты, ЗначениеКонстанты, Отказ) Экспорт
	//++ Локализация
	УстановитьЗначенияКонстантНЕУКРОбъектов(ИмяКонстанты, ЗначениеКонстанты, Отказ);
	
	//-- Локализация
	Возврат
КонецПроцедуры

Процедура УстановитьЗначенияКонстантНЕУКРОбъектов(ИмяКонстанты, ЗначениеКонстанты, Отказ)
	
	ИменаОтключаемыхНЕУКРКонстант = НастройкиСистемыПовтИсп.ПолучитьИменаОтключаемыхНЕУКРКонстант();
	
	Если (ИмяКонстанты = "ИспользоватьНЕУКРОбъекты" И ЗначениеКонстанты = Ложь) Тогда
		Для Каждого КлючИЗначение Из ИменаОтключаемыхНЕУКРКонстант Цикл
			НастройкиСистемы.УстановитьЗначениеКонстанты(Константы[КлючИЗначение.Ключ], Ложь);
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры // УстановитьЗначенияКонстантНЕУКРОбъектов


#КонецОбласти
