#Область ПрограммныйИнтерфейс

Процедура ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля) Экспорт
	
	// Запуск платформы BAF
	ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	Если НЕ ОбщегоНазначения.РазделениеВключено() Тогда
		ОписаниеПрофиля.Роли.Добавить("ЗапускТолстогоКлиента");
	КонецЕсли;
	ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
	ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	
	// Базовые права
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБЗК");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБСП");
	
	// Задачи и задания
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаданий");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеВыполнениеЗадач");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Пользователи","ВначалеВсеРазрешены");
	
	// Заметки и напоминания
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаметок");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНапоминаний");
	
	// Электронная подпись
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЭлектронныхПодписейИШифрование");
	
	// Файлы и папки файлов
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПапокИФайлов");
	
	// Подсистема печать
	ОписаниеПрофиля.Роли.Добавить("РедактированиеПечатныхФорм");
	
	// Дополнительные сведения
	ОписаниеПрофиля.Роли.Добавить("ИзменениеДополнительныхСведений");
	
	// Редактирование реквизитов объектов
	ОписаниеПрофиля.Роли.Добавить("РедактированиеРеквизитовОбъектов");
	
	// Использование дополнительных отчетов и обработок
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхОтчетовИОбработок");
	
	// Варианты отчетов
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЛичныхВариантовОтчетов");
	
	// Текущие дела
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиТекущиеДела");
	
	// Базовая НСИ
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКурсовВалют");
	
	// Отчет по движениям
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаДвиженияДокумента");
	
	Если ОписаниеПрофиля.Идентификатор = ЗарплатаКадрыРасширенный.ИдентификаторПрофиляСтаршийКадровик()
		 или ОписаниеПрофиля.Идентификатор = ЗарплатаКадрыРасширенный.ИдентификаторПрофиляСтаршийРасчетчик()
		 или ОписаниеПрофиля.Идентификатор = ЗарплатаКадрыРасширенный.ИдентификаторПрофиляСтаршийКадровикРасчетчик()
		Тогда
		ОписаниеПрофиля.Роли.Добавить("ИзменениеНормативноСправочнойИнформации");
	КонецЕсли;	
	
	ДополнитьПрофильДоступомКПодсистемам(ОписаниеПрофиля);
	
КонецПроцедуры

Процедура ДополнитьПрофильДоступомКПодсистемам(ОписаниеПрофиля) Экспорт
	
	Если ОписаниеПрофиля.Идентификатор = ЗарплатаКадрыРасширенный.ИдентификаторПрофиляКадровик()
		 ИЛИ ОписаниеПрофиля.Идентификатор = ЗарплатаКадрыРасширенный.ИдентификаторПрофиляСтаршийКадровик() Тогда
			ОписаниеПрофиля.Роли.Добавить("ПодсистемаКадры");
			ОписаниеПрофиля.Роли.Добавить("ПодсистемаНастройка");
	ИначеЕсли ОписаниеПрофиля.Идентификатор = ЗарплатаКадрыРасширенный.ИдентификаторПрофиляРасчетчик()
		 ИЛИ ОписаниеПрофиля.Идентификатор = ЗарплатаКадрыРасширенный.ИдентификаторПрофиляСтаршийРасчетчик()
		 ИЛИ ОписаниеПрофиля.Идентификатор = ЗарплатаКадрыРасширенный.ИдентификаторПрофиляТабельщик() Тогда
			ОписаниеПрофиля.Роли.Добавить("ПодсистемаЗарплата");
			ОписаниеПрофиля.Роли.Добавить("ПодсистемаНастройка");
			ОписаниеПрофиля.Роли.Добавить("ПодсистемаНалогиИВзносы");
			ОписаниеПрофиля.Роли.Добавить("ПодсистемаВыплатыПеречисления");
	Иначе
		// Аудитор, КадровикРасчетчик, СтаршийКадровикРасчетчик
		ОписаниеПрофиля.Роли.Добавить("ПодсистемаКадры");
		ОписаниеПрофиля.Роли.Добавить("ПодсистемаЗарплата");
		ОписаниеПрофиля.Роли.Добавить("ПодсистемаНастройка");
		ОписаниеПрофиля.Роли.Добавить("ПодсистемаНалогиИВзносы");
		ОписаниеПрофиля.Роли.Добавить("ПодсистемаВыплатыПеречисления");
	КонецЕсли;
	
КонецПроцедуры 

Процедура ПриЗаполненииСписковСОграничениемДоступа(Списки) Экспорт

	Списки.Вставить(Метаданные.Справочники.БанковскиеСчетаКонтрагентов, Истина);
	Списки.Вставить(Метаданные.Справочники.БанковскиеСчетаОрганизаций, Истина);
	Списки.Вставить(Метаданные.Справочники.Кассы, Истина);
	Списки.Вставить(Метаданные.Справочники.Контрагенты, Истина);
	Списки.Вставить(Метаданные.Справочники.Организации, Истина);
	Списки.Вставить(Метаданные.Справочники.ОрганизацииПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ОтветственныеЛицаОрганизаций, Истина);
	Списки.Вставить(Метаданные.Справочники.ФизическиеЛицаПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Документы.РегламентированныйОтчет, Истина);
	
КонецПроцедуры



#КонецОбласти
