////////////////////////////////////////////////////////////////////////////////
// Серверные процедуры и функции, управляющие настройками системы
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область Константы

// Возвращает структуру, описывающую "подчиненные" константы для указанной "родительской" константы.
//
//	Параметры:
//		ИмяРодительскойКонстанты 	  - Строка - имя константы как оно задано в конфигураторе
//		ЗначениеРодительскойКонстанты - Произвольный - значение константы.
//
//	Возвращаемое значение:
//		Структура
//			Ключ 	 - имя подчиненной константы
//			Значение - значение подчиненной константы, соответствующее значению родительской константы.
//
Функция ПолучитьДопустимыеЗначенияПодчиненныхКонстант(ИмяРодительскойКонстанты, ЗначениеРодительскойКонстанты) Экспорт
	
	Результат 		= Новый Структура;
	ТаблицаКонстант = НастройкиСистемыПовтИсп.ПолучитьТаблицуЗависимостиКонстант();
	
	ПодчиненныеКонстанты = ТаблицаКонстант.НайтиСтроки(
		Новый Структура(
			"ИмяРодительскойКонстанты, ЗначениеРодительскойКонстанты",
			ИмяРодительскойКонстанты, ЗначениеРодительскойКонстанты));
	
	Для Каждого СтрокаТаблицы Из ПодчиненныеКонстанты Цикл
		Результат.Вставить(СтрокаТаблицы.ИмяПодчиненнойКонстанты, СтрокаТаблицы.ЗначениеПодчиненнойКонстанты);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Возвращает признак наличия у константы "подчиненных" констант.
//
//	Параметры:
//		ИмяРодительскойКонстанты 	  - Строка - имя константы как оно задано в конфигураторе
//		ЗначениеРодительскойКонстанты - Произвольный - значение константы.
//
//	Возвращаемое значение:
//		Булево - если Истина, то у константы есть "подчиненные" ей константы.
//
Функция ЕстьПодчиненныеКонстанты(ИмяРодительскойКонстанты, ЗначениеРодительскойКонстанты) Экспорт
	
	ТаблицаКонстант = НастройкиСистемыПовтИсп.ПолучитьТаблицуЗависимостиКонстант();
	
	ПодчиненныеКонстанты = ТаблицаКонстант.НайтиСтроки(
		Новый Структура(
			"ИмяРодительскойКонстанты, ЗначениеРодительскойКонстанты",
			ИмяРодительскойКонстанты, ЗначениеРодительскойКонстанты));
	
	Возврат ПодчиненныеКонстанты.Количество() > 0;
	
КонецФункции

// Возвращает структуру, описывающую "родительские" константы для указанных "подчиненных" констант.
//
//	Параметры:
//		СтруктураПодчиненныхКонстант - Структура - имена подчиненных констант.
//
//	Возвращаемое значение:
//		Структура
//			Ключ - имя родительской константы.
//
Функция ПолучитьСтруктуруРодительскихКонстант(СтруктураПодчиненныхКонстант) Экспорт
	
	ТаблицаКонстант 	  = НастройкиСистемыПовтИсп.ПолучитьТаблицуЗависимостиКонстант();
	ОбработанныеКонстанты = Новый Структура;
	
	Результат = НастройкиСистемы.ПолучитьСтруктуруРодительскихКонстантРекурсивно(
		СтруктураПодчиненныхКонстант,
		ТаблицаКонстант,
		ОбработанныеКонстанты);
	
	Для Каждого КлючИЗначение Из СтруктураПодчиненныхКонстант Цикл
		// В родительские константы не нужно включать те, которые входят в структуру подчиненных.
		Результат.Удалить(КлючИЗначение.Ключ);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Возвращает структуру, описывающую "подчиненные" константы для указанной "родительской" константы.
//
//	Параметры:
//		ИмяРодительскойКонстанты - Структура - имя родительской константы.
//
//	Возвращаемое значение:
//		Структура
//			Ключ - имя подчиненной константы.
//
Функция ПолучитьСтруктуруПодчиненныхКонстант(ИмяРодительскойКонстанты) Экспорт
	
	ТаблицаКонстант = НастройкиСистемыПовтИсп.ПолучитьТаблицуЗависимостиКонстант();
	ОбработанныеКонстанты = Новый Структура;
	
	Результат = НастройкиСистемы.ПолучитьСтруктуруПодчиненныхКонстантРекурсивно(
		ИмяРодительскойКонстанты,
		ТаблицаКонстант,
		ОбработанныеКонстанты);
	
	Возврат Результат;
	
КонецФункции

// Возвращает значения констант в новой ИБ по умолчанию.
//
Функция ПолучитьЗначенияКонстантПоУмолчанию() Экспорт
	
	БазоваяВерсия = СтандартныеПодсистемыСервер.ЭтоБазоваяВерсияКонфигурации();
	
	Результат = Новый Структура;
	
#Область Служебные_константы
	Результат.Вставить(Метаданные.Константы.БазоваяВерсия.Имя, 				 БазоваяВерсия);
	Результат.Вставить(Метаданные.Константы.НеБазоваяВерсия.Имя, 				 Не БазоваяВерсия);
	Результат.Вставить(Метаданные.Константы.ИспользоватьУправлениеДоступом.Имя, Не БазоваяВерсия);
#КонецОбласти


#Область Интерфейс
	ТекущийРежим = Метаданные.РежимСовместимостиИнтерфейса;
	Такси = (ТекущийРежим = Метаданные.СвойстваОбъектов.РежимСовместимостиИнтерфейса.Такси
		ИЛИ ТекущийРежим = Метаданные.СвойстваОбъектов.РежимСовместимостиИнтерфейса.ТаксиРазрешитьВерсия8_2)
		ИЛИ БазоваяВерсия;
	Результат.Вставить(Метаданные.Константы.ИнтерфейсВерсии82.Имя, НЕ Такси);
#КонецОбласти


#Область БазоваяВерсия
	Если БазоваяВерсия Тогда
		Результат.Вставить(Метаданные.Константы.ИспользоватьСинхронизациюДанных.Имя, Истина);
	Иначе
	КонецЕсли;
#КонецОбласти


#Область Печать
	Результат.Вставить(Метаданные.Константы.ДополнительнаяКолонкаПечатныхФормДокументов.Имя, Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.НеВыводить);
#КонецОбласти

	

	НастройкиСистемыЛокализация.ДополнитьЗначенияКонстантПоУмолчанию(Результат);
	
	// Дополним структуру константами, которые имеют подчиненные константы.
	ТаблицаКонстант = НастройкиСистемыПовтИсп.ПолучитьТаблицуЗависимостиКонстант();
	
	ТаблицаЗависимыхКонстант = ТаблицаКонстант.Скопировать();
	ТаблицаЗависимыхКонстант.Свернуть("ИмяРодительскойКонстанты", "");
	
	МодульРаботаВМоделиСервиса = ОбщегоНазначения.ОбщийМодуль("РаботаВМоделиСервиса");
	МодельДанных = МодульРаботаВМоделиСервиса.ПолучитьМодельДанныхОбласти();
	
	Для Каждого Строка Из ТаблицаЗависимыхКонстант Цикл
		Если НЕ Результат.Свойство(Строка.ИмяРодительскойКонстанты) 
			И (НЕ ОбщегоНазначения.РазделениеВключено() 
			И НЕ Строка.ИмяРодительскойКонстанты = "НеИспользоватьРазделениеПоОбластямДанных"
			ИЛИ МодельДанных.Получить("Константа."+Строка.ИмяРодительскойКонстанты) <> Неопределено) Тогда
			Результат.Вставить(
				Строка.ИмяРодительскойКонстанты,
				Метаданные.Константы[Строка.ИмяРодительскойКонстанты].Тип.ПривестиЗначение());
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Возвращает значения констант контролируемых в базовой версии.
//
Функция ЗначенияКонстантКонтролируемыхВБазовойВерсии() Экспорт 
	
	Результат = Новый Структура;
	
	НастройкиСистемыЛокализация.ДополнитьЗначенияКонстантКонтролируемыхВБазовойВерсии(Результат);
	
	Возврат Результат;
	
КонецФункции

// Возвращает список констант, которые доступны для изменения в базовой версии.
//
Функция КонстантыДоступныеВБазовойВерсии() Экспорт 

	Результат = Новый Структура;
	НастройкиСистемыЛокализация.ДополнитьКонстантыДоступныеВБазовойВерсии(Результат);
	
	Возврат Результат;
	
КонецФункции

// Возвращает значения констант контролируемых в НЕ базовой версии.
//
Функция ЗначенияКонстантКонтролируемыхВНеБазовойВерсии() Экспорт 
	
	Результат = Новый Структура;
	НастройкиСистемыЛокализация.ДополнитьЗначенияКонстантКонтролируемыхВНеБазовойВерсии(Результат);
	
	Возврат Результат;
	
КонецФункции

// Возвращает таблицу, описывающую зависимость констант в конфигурации.
// Каждая строка таблицы означает:
// для родительской константы со значением Х допустимо только значение Y для подчиненной константы.
//
// Возвращаемое значение:
//	см. НастройкиСистемы.ИнициализироватьТаблицуЗначенийКонстант
//
Функция ПолучитьТаблицуЗависимостиКонстант() Экспорт
	
	БазоваяВерсия = СтандартныеПодсистемыСервер.ЭтоБазоваяВерсияКонфигурации();
	
	Результат = НастройкиСистемы.ИнициализироватьТаблицуЗначенийКонстант();


#Область Почта
	НастройкиСистемы.ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		Метаданные.Константы.ИспользоватьПочтовыйКлиент.Имя, Ложь,
		Метаданные.Константы.ИспользоватьПризнакРассмотрено.Имя, Ложь);
	НастройкиСистемы.ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		Метаданные.Константы.ИспользоватьПочтовыйКлиент.Имя, Ложь,
		Метаданные.Константы.ИспользоватьПрочиеВзаимодействия.Имя, Ложь);
	НастройкиСистемы.ДобавитьСтрокуТаблицыЗависимостиКонстант(Результат,
		Метаданные.Константы.ИспользоватьПочтовыйКлиент.Имя, Ложь,
		Метаданные.Константы.ОтправлятьПисьмаВФорматеHTML.Имя, Ложь);
#КонецОбласти


#Область Контролируемые_в_Базовой
	// Константы контролируемые в Базовой версии
	ЗначенияКонстант = НастройкиСистемыПовтИсп.ЗначенияКонстантКонтролируемыхВБазовойВерсии();
	Для каждого ЗначениеКонстанты Из ЗначенияКонстант Цикл
		
		Если ЗначениеКонстанты.Ключ = "БазоваяВерсия" Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = Результат.Добавить();
		НоваяСтрока.ИмяРодительскойКонстанты 	  = "БазоваяВерсия";
		НоваяСтрока.ЗначениеРодительскойКонстанты = Истина;
		НоваяСтрока.ИмяПодчиненнойКонстанты 	  = ЗначениеКонстанты.Ключ;
		НоваяСтрока.ЗначениеПодчиненнойКонстанты  = ЗначениеКонстанты.Значение;
	
	КонецЦикла;
#КонецОбласти

#Область Контролируемые_в_НЕ_Базовой
	// Константы контролируемые в НЕ Базовой версии
	ЗначенияКонстант = НастройкиСистемыПовтИсп.ЗначенияКонстантКонтролируемыхВНеБазовойВерсии();
	Для каждого ЗначениеКонстанты Из ЗначенияКонстант Цикл
		
		Если ЗначениеКонстанты.Ключ = "БазоваяВерсия" Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = Результат.Добавить();
		НоваяСтрока.ИмяРодительскойКонстанты 	  = "БазоваяВерсия";
		НоваяСтрока.ЗначениеРодительскойКонстанты = Ложь;
		НоваяСтрока.ИмяПодчиненнойКонстанты 	  = ЗначениеКонстанты.Ключ;
		НоваяСтрока.ЗначениеПодчиненнойКонстанты  = ЗначениеКонстанты.Значение;
	
	КонецЦикла;
#КонецОбласти

	НастройкиСистемыЛокализация.ДополнитьТаблицуЗависимостиКонстант(Результат);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьИменаОтключаемыхНЕУКРКонстант() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("ИспользованиеКлассификаторовНоменклатуры");
	Результат.Вставить("ИспользоватьАктыНаПередачуПрав");
	Результат.Вставить("ИспользоватьКорректировкиПоступлений");
	Результат.Вставить("ИспользоватьКорректировкиРеализаций");
	Результат.Вставить("ИспользоватьЛизинг");
    Результат.Вставить("ИспользоватьМеханизмОнлайнСервисовРО");
	Результат.Вставить("ИспользоватьОбменЭД");
	Результат.Вставить("ИспользоватьОбменЭДМеждуОрганизациями");
	Результат.Вставить("ИспользоватьОтгрузкуБезПереходаПраваСобственности");
	Результат.Вставить("ИспользоватьПродажуАгентскихУслуг");
	Результат.Вставить("ИспользоватьУчетДрагоценныхМатериалов");
	Результат.Вставить("РазрешенаРаботаСНовостями");
	Результат.Вставить("РазрешенаРаботаСНовостямиЧерезИнтернет");
	Результат.Вставить("ИспользоватьОбособленныеПодразделенияВыделенныеНаБаланс");
	Результат.Вставить("ИспользоватьОказаниеАгентскихУслугПриЗакупке");
	Результат.Вставить("ИспользоватьТоварыВПутиОтПоставщиков");
	Результат.Вставить("ЗакупкаУПоставщикаТоварыВПути");

    
	Возврат Результат;
	
КонецФункции // ПолучитьИменаОтключаемыхНЕУКРКонстант()

#КонецОбласти

#КонецОбласти

