
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПрочитатьНастройки();
КонецПроцедуры

&НаСервере
Процедура ПрочитатьНастройки()
	
	ИспользоватьНесколькоОрганизаций = ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоОрганизаций");
	ИнтерфейсБЗК = ПолучитьФункциональнуюОпцию("ИнтерфейсБЗК");
	
	Если СтандартныеПодсистемыСервер.ЭтоБазоваяВерсияКонфигурации() Тогда
		Элементы.ГруппаСтраницыИспользоватьНесколькоОрганизаций.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИспользоватьНесколькоОрганизацийПриИзмененииНаСервере()
	
	НастройкиСистемы.УстановитьЗначениеКонстанты(Константы.ИспользоватьНесколькоОрганизаций, ИспользоватьНесколькоОрганизаций);
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьНесколькоОрганизацийПриИзменении(Элемент)
	ИспользоватьНесколькоОрганизацийПриИзмененииНаСервере();
	ОбщегоНазначенияКлиент.ОбновитьИнтерфейсПрограммы();
КонецПроцедуры

&НаСервере
Процедура ИнтерфейсБЗКПриИзмененииНаСервере()
	НастройкиСистемы.УстановитьЗначениеКонстанты(Константы.ИнтерфейсБЗК, ИнтерфейсБЗК);
	НастройкиСистемы.УстановитьЗначениеКонстанты(Константы.ИнтерфейсERP, НЕ ИнтерфейсБЗК);	
КонецПроцедуры

&НаКлиенте
Процедура ИнтерфейсБЗКПриИзменении(Элемент)
	ИнтерфейсБЗКПриИзмененииНаСервере();
	ОбщегоНазначенияКлиент.ОбновитьИнтерфейсПрограммы();	
КонецПроцедуры
