
#Область СлужебныеПроцедурыИФункции

#Область УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииСписковСОграничениемДоступа(Списки) Экспорт
	Списки.Вставить(Метаданные.Документы.ДепонированиеЗарплаты, Истина);
	Списки.Вставить(Метаданные.Документы.СписаниеДепонированнойЗарплаты, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ВзаиморасчетыСДепонентами, Истина);
КонецПроцедуры

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииВидовОграниченийПравОбъектовМетаданных.
Процедура ПриЗаполненииВидовОграниченийПравОбъектовМетаданных(Описание) Экспорт
	
	Описание = Описание + "
	|Документ.ДепонированиеЗарплаты.Чтение.ГруппыФизическихЛиц
	|Документ.ДепонированиеЗарплаты.Чтение.Организации
	|Документ.ДепонированиеЗарплаты.Изменение.ГруппыФизическихЛиц
	|Документ.ДепонированиеЗарплаты.Изменение.Организации
	|Документ.СписаниеДепонированнойЗарплаты.Чтение.ГруппыФизическихЛиц
	|Документ.СписаниеДепонированнойЗарплаты.Чтение.Организации
	|Документ.СписаниеДепонированнойЗарплаты.Изменение.ГруппыФизическихЛиц
	|Документ.СписаниеДепонированнойЗарплаты.Изменение.Организации
	|РегистрНакопления.ВзаиморасчетыСДепонентами.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ВзаиморасчетыСДепонентами.Чтение.Организации";
	
КонецПроцедуры

#КонецОбласти

#Область ДокументДепонированиеЗарплаты

/// Обработчики событий модуля объекта документов Депонирование зарплаты.

Процедура ДепонированиеЗарплатыОбработкаПроведения(ДокументОбъект, Отказ) Экспорт
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ДокументОбъект);
	
	Ведомости	= ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДокументОбъект.Ведомость);
	ФизЛица		= ОбщегоНазначенияКлиентСервер.СвернутьМассив(ДокументОбъект.Депоненты.ВыгрузитьКолонку("ФизическоеЛицо"));
	
	Если НЕ Отказ Тогда
			
		ДанныеВедомости = ВзаиморасчетыССотрудниками.ДанныеВедомостейДляОплатыДокументом(ДокументОбъект.Ссылка, Ведомости, Физлица, Неопределено);
	
		ДепонируемаяЗарплата = УчетДепонированнойЗарплаты.НоваяТаблицаДепонированнойЗарплаты();
		Для Каждого СтрокаДанныхВедомости Из ДанныеВедомости Цикл
			СтрокаДепонируемойЗарплаты = ДепонируемаяЗарплата.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаДепонируемойЗарплаты, СтрокаДанныхВедомости);
			СтрокаДепонируемойЗарплаты.Сумма = СтрокаДанныхВедомости.СуммаКВыплате;
		КонецЦикла;	
		ДепонируемаяЗарплата.ЗаполнитьЗначения(ДокументОбъект.Организация, "Организация");
		ДепонируемаяЗарплата.ЗаполнитьЗначения(ДокументОбъект.Дата, "Дата");
		ДепонируемаяЗарплата.ЗаполнитьЗначения(ДокументОбъект.Ведомость, "Ведомость");
			
		УчетДепонированнойЗарплаты.ЗарегистрироватьДепонированнуюЗарплату(ДокументОбъект.Движения, Отказ, ДепонируемаяЗарплата, Истина);
		
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область Печать

// Возвращает описание команды печати реестра депонированных сумм.
// 
// Возвращаемое значение:
//   Структура - структура с полями:
//		* ПредставлениеКоманды - строка.
//
Функция ОписаниеПечатиРеестраДепонированныхСумм() Экспорт
	
	ОписаниеПечатиРеестраДепонированныхСумм = Новый Структура;
	ОписаниеПечатиРеестраДепонированныхСумм.Вставить("ПредставлениеКоманды",  НСтр("ru = 'Печать реестра депонированных сумм'; uk = 'Друк реєстру депонованих сум'"));
	ОписаниеПечатиРеестраДепонированныхСумм.Вставить("ИмяМакета", "Документ.ДепонированиеЗарплаты.ПФ_MXL_РеестрДепонированныхСумм");
	ОписаниеПечатиРеестраДепонированныхСумм.Вставить("СинонимМакета", НСтр("ru = 'Реестр депонированных сумм'; uk = 'Реєстр депонованих сум'"));
	
	Возврат ОписаниеПечатиРеестраДепонированныхСумм
	
КонецФункции

Процедура ПриКомпоновкеОтчетаКнигаУчетаДепонентов(Объект, ДокументРезультат, СтандартнаяОбработка) Экспорт
	
	КлючВарианта = ЗарплатаКадрыОтчеты.КлючВарианта(Объект.КомпоновщикНастроек);
	Если КлючВарианта <> "КнигаУчетаДепонентов" Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		
		СтандартнаяОбработка = Ложь;
		ДокументРезультат.НачатьАвтогруппировкуСтрок();
		ДокументРезультат.Очистить();
		
		НастройкиОтчета = Объект.КомпоновщикНастроек.ПолучитьНастройки();
		НастройкиОтчета.Выбор.Элементы.Очистить();
		
		СоответствиеПользовательскихПолей = ЗарплатаКадрыОтчеты.СоответствиеПользовательскихПолей(НастройкиОтчета);
		
		ЗначениеПараметраПериод = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"));
		
		Если ЗначениеПараметраПериод <> Неопределено И ЗначениеПараметраПериод.Значение <> '00010101' Тогда
			НачалоПериода = ЗначениеПараметраПериод.Значение.ДатаНачала;
			КонецПериода  = ЗначениеПараметраПериод.Значение.ДатаОкончания;
		Иначе
			НачалоПериода = НачалоМесяца(ТекущаяДатаСеанса());
			КонецПериода  = КонецМесяца(ТекущаяДатаСеанса());
		КонецЕсли;
		
		Если НачалоПериода = '00010101' Тогда
			НачалоПериода = НачалоМесяца(ТекущаяДатаСеанса());
		КонецЕсли;
		
		Если КонецПериода = '00010101' Тогда
			КонецПериода  = КонецМесяца(ТекущаяДатаСеанса());
		КонецЕсли;
		
		Данные = Новый ДеревоЗначений;
		
		МакетКомпоновки = ЗарплатаКадрыОтчеты.МакетКомпоновкиДанныхДляКоллекцииЗначений(Объект.СхемаКомпоновкиДанных, НастройкиОтчета);
		
		// Создадим и инициализируем процессор компоновки.
		ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , , Истина);
		
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
		ПроцессорВывода.УстановитьОбъект(Данные);
		
		// Обозначим начало вывода
		ПроцессорВывода.Вывести(ПроцессорКомпоновки, Истина);
		
		ВывестиМакетыСГруппировкамиКнигаДепонентов(ДокументРезультат, Данные, НачалоПериода, КонецПериода, СоответствиеПользовательскихПолей, НастройкиОтчета);
		
		ДокументРезультат.ЗакончитьАвтогруппировкуСтрок();
		
	Исключение
		ВызватьИсключение НСтр("ru = 'В настройку отчета внесены критичные изменения. Книга учета депонентов не будет сформирована.'; uk = 'В настройку звіту внесено критичні зміни. Книгу обліку депонентів не буде сформовано.'") + " " + КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
КонецПроцедуры

Процедура ВывестиМакетыСГруппировкамиКнигаДепонентов(ДокументРезультат, Данные, НачалоПериода, КонецПериода, СоответствиеПользовательскихПолей, НастройкиОтчета)
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Отчет.КнигаУчетаДепонентов.ПФ_MXL_КнигаУчетаДепонентов");
	
	Для Каждого ДанныеШапкиОтчета Из Данные.Строки Цикл
		
		Если ДокументРезультат.ВысотаТаблицы > 0 Тогда
			ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		Шапка	= Макет.ПолучитьОбласть("Шапка");

		Шапка.Параметры.Заполнить(ДанныеШапкиОтчета);
		Шапка.Параметры.Начало		= НачалоПериода;
		Шапка.Параметры.Окончание	= КонецПериода;
		
		ДокументРезультат.Вывести(Шапка);
		ИтогоОстатокНач = 0;
		
		Для Каждого ДанныеСтрокиОтчета Из ДанныеШапкиОтчета.Строки Цикл
			
			Строка	= Макет.ПолучитьОбласть("Строка");
			Строка.Параметры.Заполнить(ДанныеСтрокиОтчета);
			
			ЗарплатаКадрыОтчеты.ЗаполнитьПараметрыПользовательскихПолей(Строка, ДанныеСтрокиОтчета, СоответствиеПользовательскихПолей);
			
			НомераПлатежныхДокументов = "";
			Для Каждого СтрокаСНомером Из ДанныеСтрокиОтчета.Строки Цикл
				НомераПлатежныхДокументов = ?(ПустаяСтрока(НомераПлатежныхДокументов), "", НомераПлатежныхДокументов + "; ") + СтрокаСНомером.НомерПлатежногоДокумента;
			КонецЦикла;
			
			Строка.Параметры.НомерПлатежногоДокумента = НомераПлатежныхДокументов;
			
			ДокументРезультат.Вывести(Строка);
			
			Если ЗначениеЗаполнено(ДанныеСтрокиОтчета.ОстатокНач) Тогда
				ИтогоОстатокНач = ИтогоОстатокНач + ДанныеСтрокиОтчета.ОстатокНач;
			ИначеЕсли ЗначениеЗаполнено(ДанныеСтрокиОтчета.ВедомостьСуммаПоступления) Тогда
				ИтогоОстатокНач = ИтогоОстатокНач + ДанныеСтрокиОтчета.ВедомостьСуммаПоступления;
			КонецЕсли; 
		КонецЦикла;
		
		Подвал	= Макет.ПолучитьОбласть("Подвал");
		Подвал.Параметры.Заполнить(ДанныеШапкиОтчета);
		
		Подвал.Параметры.ОстатокНаКонец = ИтогоОстатокНач - ДанныеШапкиОтчета.СуммаДвижения;
		
		ЗарплатаКадрыОтчеты.ЗаполнитьПараметрыПользовательскихПолей(Подвал, ДанныеШапкиОтчета, СоответствиеПользовательскихПолей);
		
		// Главный бухгалтер
		ПараметрГлавныйБухгалтер = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ГлавныйБухгалтер"));
		Если ПараметрГлавныйБухгалтер.Использование Тогда
			ГлавныйБухгалтер = ПараметрГлавныйБухгалтер.Значение;
		Иначе
			
			ЗапрашиваемыеЗначения = Новый Структура("Организация,ГлавныйБухгалтер");
			ЗапрашиваемыеЗначения.Организация = ДанныеШапкиОтчета.Организация;
			ЗарплатаКадры.ПолучитьЗначенияПоУмолчанию(ЗапрашиваемыеЗначения);
			
			ГлавныйБухгалтер = ЗапрашиваемыеЗначения.ГлавныйБухгалтер;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ГлавныйБухгалтер) Тогда
			ТаблицаФИО = КадровыйУчет.КадровыеДанныеФизическихЛиц(Истина, ГлавныйБухгалтер, "ИОФамилия", ДанныеШапкиОтчета.Год);
			Если ТаблицаФИО.Количество() > 0 Тогда
				Подвал.Параметры.ГлавныйБухгалтерРасшифровкаПодписи = ТаблицаФИО[0].ИОФамилия;
			КонецЕсли;
		КонецЕсли; 
			
		// Исполнитель
		ПараметрИсполнитель = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Исполнитель"));
		Если ПараметрИсполнитель.Использование Тогда
			Исполнитель = ПараметрИсполнитель.Значение;
		Иначе
			
			ЗапрашиваемыеЗначения = Новый Структура("Организация,Исполнитель");
			ЗапрашиваемыеЗначения.Организация = ДанныеШапкиОтчета.Организация;
			
			Исполнитель = ЗапрашиваемыеЗначения.Исполнитель;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Исполнитель) Тогда
			ТаблицаФИО = КадровыйУчет.КадровыеДанныеФизическихЛиц(Истина, Исполнитель, "ИОФамилия", ДанныеШапкиОтчета.Год);
			Если ТаблицаФИО.Количество() > 0 Тогда
				Подвал.Параметры.ИсполнительРасшифровкаПодписи = ТаблицаФИО[0].ИОФамилия;
			КонецЕсли;
		КонецЕсли; 
			
		// Должность исполнителя
		ПараметрДолжностьИсполнителя = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ДолжностьИсполнителя"));
		Если ПараметрДолжностьИсполнителя.Использование Тогда
			ДолжностьИсполнителя = ПараметрДолжностьИсполнителя.Значение;
		Иначе
			
			ЗапрашиваемыеЗначения = Новый Структура("Организация,ДолжностьИсполнителя");
			ЗапрашиваемыеЗначения.Организация = ДанныеШапкиОтчета.Организация;
			
			ДолжностьИсполнителя = ЗапрашиваемыеЗначения.ДолжностьИсполнителя;
			
		КонецЕсли;
		
		Подвал.Параметры.ДолжностьИсполнителя = ДолжностьИсполнителя;
			
		ДокументРезультат.Вывести(Подвал);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

Процедура НастроитьВариантыОтчетов(Настройки) Экспорт
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.КнигаУчетаДепонентов, "Форма0504048");
	Вариант.Включен = Ложь;

КонецПроцедуры

#КонецОбласти
