////////////////////////////////////////////////////////////////////////////////
// Серверные процедуры и функции, управляющие настройками системы
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

Процедура ПередЗаписьюКонстантыПередЗаписью(Источник, Отказ) Экспорт

	
	МетаданныеКонстанты = Источник.ЭтотОбъект.Метаданные();
	ИмяКонстанты		= МетаданныеКонстанты.Имя;
	ЗначениеКонстанты 	= Источник.Значение;

	ИменаОтключаемыхНЕУКРКонстант = НастройкиСистемыПовтИсп.ПолучитьИменаОтключаемыхНЕУКРКонстант();
	
	Если ИменаОтключаемыхНЕУКРКонстант.Свойство(ИмяКонстанты) И ЗначениеКонстанты = Истина Тогда 	
		Отказ = Истина;
		ВызватьИсключение НСтр("ru='Не разрешается изменять значение этой константы!';uk='Не дозволяється змінювати значення цієї константи!'");
	КонецЕсли;
	
	Если НЕ СтандартныеПодсистемыСервер.ЭтоБазоваяВерсияКонфигурации() Тогда
		Возврат;
	КонецЕсли;
	
	ЗначенияКонстант = НастройкиСистемыПовтИсп.ЗначенияКонстантКонтролируемыхВБазовойВерсии();
	
	КонтролируемоеЗначение = Неопределено;
	Если ЗначенияКонстант.Свойство(ИмяКонстанты, КонтролируемоеЗначение) Тогда
		Если ЗначениеКонстанты <> КонтролируемоеЗначение Тогда
			Отказ = Истина;
			ВызватьИсключение НСтр("ru='Не разрешается изменять значение этой константы!';uk='Не дозволяється змінювати значення цієї константи!'");
		КонецЕсли;
	КонецЕсли;	

КонецПроцедуры

#КонецОбласти
