////////////////////////////////////////////////////////////////////////////////
// Серверные процедуры и функции, управляющие настройками системы
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

Процедура ПередЗаписьюКонстантыПередЗаписью(Источник, Отказ) Экспорт

	Если НЕ СтандартныеПодсистемыСервер.ЭтоБазоваяВерсияКонфигурации() Тогда
		Возврат;
	КонецЕсли;
	
	МетаданныеКонстанты = Источник.ЭтотОбъект.Метаданные();
	ИмяКонстанты		= МетаданныеКонстанты.Имя;
	ЗначениеКонстанты 	= Источник.Значение;
	
	ЗначенияКонстант = НастройкиСистемыПовтИсп.ЗначенияКонстантКонтролируемыхВБазовойВерсии();
	
	КонтролируемоеЗначение = Неопределено;
	Если ЗначенияКонстант.Свойство(ИмяКонстанты, КонтролируемоеЗначение) Тогда
		Если ЗначениеКонстанты <> КонтролируемоеЗначение Тогда
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;	
	

КонецПроцедуры

#КонецОбласти
