#Область ПрограммныйИнтерфейс

// Определяет объекты конфигурации, в модулях менеджеров которых размещена процедура ДобавитьКомандыПечати,
// формирующая список команд печати, предоставляемых этим объектом.
// Синтаксис процедуры ДобавитьКомандыПечати см. в документации к подсистеме.
//
// Параметры:
//  СписокОбъектов - Массив - менеджеры объектов с процедурой ДобавитьКомандыПечати.
//
Процедура ПриОпределенииОбъектовСКомандамиПечати(СписокОбъектов) Экспорт

	//++ Локализация
	
	
	//++ НЕ УТ
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаИУправлениеПерсоналом") Тогда
		СписокОбъектов.Добавить(Документы.АктПриемкиВыполненныхРаботОказанныхУслуг);
		СписокОбъектов.Добавить(Документы.АктПроверкиСтраховыхВзносов);
		СписокОбъектов.Добавить(Документы.БольничныйЛист);
		СписокОбъектов.Добавить(Документы.БронированиеГражданПребывающихВЗапасе);
		СписокОбъектов.Добавить(Документы.ВводНачальныхОстатковОтпусков);
		СписокОбъектов.Добавить(Документы.ВедомостьНаВыплатуЗарплатыВБанк);
		СписокОбъектов.Добавить(Документы.ВедомостьНаВыплатуЗарплатыВКассу);
		СписокОбъектов.Добавить(Документы.ВедомостьНаВыплатуЗарплатыПеречислением);
		СписокОбъектов.Добавить(Документы.ВедомостьНаВыплатуЗарплатыРаздатчиком);
		СписокОбъектов.Добавить(Документы.ВозвратИзОтпускаПоУходуЗаРебенком);
		СписокОбъектов.Добавить(Документы.ВходящаяСправкаОЗаработкеДляРасчетаПособий);
		СписокОбъектов.Добавить(Документы.ВыплатаБывшимСотрудникам);
		СписокОбъектов.Добавить(Документы.ГрафикОтпусков);
		СписокОбъектов.Добавить(Документы.ДанныеДляРасчетаЗарплаты);
		СписокОбъектов.Добавить(Документы.ДоговорАвторскогоЗаказа);
		СписокОбъектов.Добавить(Документы.ДоговорЗаймаСотруднику);
		СписокОбъектов.Добавить(Документы.ДоговорРаботыУслуги);
		СписокОбъектов.Добавить(Документы.ДоходВНатуральнойФорме);
		СписокОбъектов.Добавить(Документы.ЕдиновременноеПособиеЗаСчетФСС);
		СписокОбъектов.Добавить(Документы.ЗаявкаНаЗакрытиеЛицевыхСчетовСотрудников);
		СписокОбъектов.Добавить(Документы.ЗаявкаНаОткрытиеЛицевыхСчетовСотрудников);
	    СписокОбъектов.Добавить(Документы.ЗаявлениеНаПредоставлениеЛьготыПоНДФЛ);
		СписокОбъектов.Добавить(Документы.ИзменениеАванса);
		СписокОбъектов.Добавить(Документы.ИзменениеГрафикаРаботыСписком);
		СписокОбъектов.Добавить(Документы.ИзменениеКвалификационногоРазряда);
		СписокОбъектов.Добавить(Документы.ИзменениеОплатыТруда);
		СписокОбъектов.Добавить(Документы.ИзменениеПлановыхНачислений);
		СписокОбъектов.Добавить(Документы.ИзменениеУсловийДоговораЗаймаСотруднику);
		СписокОбъектов.Добавить(Документы.ИзменениеУсловийИсполнительногоЛиста);
		СписокОбъектов.Добавить(Документы.ИзменениеУсловийОплатыОтпускаПоУходуЗаРебенком);
		СписокОбъектов.Добавить(Документы.ИзменениеШтатногоРасписания);
		СписокОбъектов.Добавить(Документы.ИндексацияЗаработка);
		СписокОбъектов.Добавить(Документы.ИндексацияШтатногоРасписания);
		СписокОбъектов.Добавить(Документы.ИндивидуальныйГрафик);
		СписокОбъектов.Добавить(Документы.ИсполнительныйЛист);
		СписокОбъектов.Добавить(Документы.КадровыйПеревод);
		СписокОбъектов.Добавить(Документы.КадровыйПереводСписком);
		СписокОбъектов.Добавить(Документы.Командировка);
		СписокОбъектов.Добавить(Документы.КомандировкиСотрудников);
		СписокОбъектов.Добавить(Документы.ЛистокСообщенияДляВоенкомата);
		СписокОбъектов.Добавить(Документы.МатериальнаяПомощь);
		СписокОбъектов.Добавить(Документы.НачальнаяЗадолженностьПоЗарплате);
		СписокОбъектов.Добавить(Документы.НачальнаяШтатнаяРасстановка);
		СписокОбъектов.Добавить(Документы.НачислениеЗаПервуюПоловинуМесяца);
		СписокОбъектов.Добавить(Документы.НачислениеЗарплаты);
		СписокОбъектов.Добавить(Документы.НачислениеОценочныхОбязательствПоОтпускам);
		СписокОбъектов.Добавить(Документы.ОперацияНалоговогоУчетаПоНДФЛ);
		СписокОбъектов.Добавить(Документы.ОперацияУчетаПоСтраховымВзносам);
		СписокОбъектов.Добавить(Документы.ОплатаПоСреднемуЗаработку);
		СписокОбъектов.Добавить(Документы.Отгул);
		СписокОбъектов.Добавить(Документы.ОтменаБронированияГражданПребывающихВЗапасе);
		СписокОбъектов.Добавить(Документы.ОтменаДоплатыДоСреднегоЗаработка);
		СписокОбъектов.Добавить(Документы.ОтменаСовмещения);
		СписокОбъектов.Добавить(Документы.Отпуск);
		СписокОбъектов.Добавить(Документы.ОтпускаСотрудников);
		СписокОбъектов.Добавить(Документы.ОтпускБезСохраненияОплаты);
		СписокОбъектов.Добавить(Документы.ОтпускПоУходуЗаРебенком);
		СписокОбъектов.Добавить(Документы.ОтражениеЗарплатыВФинансовомУчете);
		СписокОбъектов.Добавить(Документы.ПереводКДругомуРаботодателю);
		СписокОбъектов.Добавить(Документы.ПеремещениеВДругоеПодразделение);
		СписокОбъектов.Добавить(Документы.ПеремещениеМеждуТерриториями);
		СписокОбъектов.Добавить(Документы.ПереносДанных);
		СписокОбъектов.Добавить(Документы.ПереносОтпуска);
		СписокОбъектов.Добавить(Документы.ПерерасчетНДФЛ);
	    СписокОбъектов.Добавить(Документы.ПодтверждениеВыплатЗаСчетФСС);
		СписокОбъектов.Добавить(Документы.ПодтверждениеЗачисленияЗарплаты);
		СписокОбъектов.Добавить(Документы.ПодтверждениеОткрытияЛицевыхСчетовСотрудников);
		СписокОбъектов.Добавить(Документы.ПостоянноеУдержаниеВПользуТретьихЛиц);
	    СписокОбъектов.Добавить(Документы.ПрекращениеЛьготПоНДФЛ);
		СписокОбъектов.Добавить(Документы.Премия);
		СписокОбъектов.Добавить(Документы.ПриемНаРаботу);
		СписокОбъектов.Добавить(Документы.ПриемНаРаботуСписком);
		СписокОбъектов.Добавить(Документы.ПризПодарок);
		СписокОбъектов.Добавить(Документы.ПриказНаДоплатуДоСреднегоЗаработка);
		СписокОбъектов.Добавить(Документы.ПрогулНеявка);
		СписокОбъектов.Добавить(Документы.ПродлениеКонтрактаДоговора);
		СписокОбъектов.Добавить(Документы.ПростойСотрудников);
		СписокОбъектов.Добавить(Документы.РаботаВВыходныеИПраздничныеДни);
		СписокОбъектов.Добавить(Документы.РаботаСверхурочно);
		СписокОбъектов.Добавить(Документы.РазовоеНачисление);
		СписокОбъектов.Добавить(Документы.РаспределениеОсновногоЗаработка);
		СписокОбъектов.Добавить(Документы.РегистрацияПереработок);
		СписокОбъектов.Добавить(Документы.РегистрацияПрочихДоходов);
		СписокОбъектов.Добавить(Документы.Совмещение);
	    СписокОбъектов.Добавить(Документы.СправкаОДоходах);
		СписокОбъектов.Добавить(Документы.СторнированиеНачислений);
		СписокОбъектов.Добавить(Документы.ТабельУчетаРабочегоВремени);
		СписокОбъектов.Добавить(Документы.Увольнение);
		СписокОбъектов.Добавить(Документы.УвольнениеСписком);
		СписокОбъектов.Добавить(Документы.УдержаниеВСчетРасчетовПоПрочимОперациям);
		СписокОбъектов.Добавить(Документы.УдержаниеПрофсоюзныхВзносов);
		СписокОбъектов.Добавить(Документы.УтверждениеТарифнойСетки);
		СписокОбъектов.Добавить(Документы.УтверждениеШтатногоРасписания);
		СписокОбъектов.Добавить(Справочники.ГрафикиРаботыСотрудников);
		СписокОбъектов.Добавить(Справочники.Сотрудники);
		СписокОбъектов.Добавить(Справочники.ШтатноеРасписание);
		
		СписокОбъектов.Добавить(Документы.ЗаявлениеРасчетВФСС);
		СписокОбъектов.Добавить(Документы.ПодтверждениеВыплатЗаСчетФСС);
		СписокОбъектов.Добавить(Документы.ЗаявлениеНаПредоставлениеЛьготыПоНДФЛ);
		СписокОбъектов.Добавить(Документы.ПрекращениеЛьготПоНДФЛ);

		МодульУчетДепонированнойЗарплаты = ОбщегоНазначения.ОбщийМодуль("УчетДепонированнойЗарплаты");
		МодульУчетДепонированнойЗарплаты.ПриОпределенииОбъектовСКомандамиПечати(СписокОбъектов);
		
	КонецЕсли;
	//-- НЕ УТ

	
	
	//++ НЕ УТ
	РегламентированнаяОтчетность.ПриОпределенииОбъектовСКомандамиПечати(СписокОбъектов);
	//-- НЕ УТ
	
	//-- Локализация
	
КонецПроцедуры

// Переопределяет список команд печати, получаемый функцией УправлениеПечатью.КомандыПечатиФормы.
// Используется для общих форм, у которых нет модуля менеджера для размещения в нем процедуры ДобавитьКомандыПечати,
// для случаев, когда штатных средств добавления команд в такие формы недостаточно. Например, если нужны свои команды,
// которых нет в других объектах.
// 
// Параметры:
//  ИмяФормы             - Строка - полное имя формы, в которой добавляются команды печати;
//  КомандыПечати        - ТаблицаЗначений - см. УправлениеПечатью.СоздатьКоллекциюКомандПечати;
//  СтандартнаяОбработка - Булево - при установке значения Ложь не будет автоматически заполняться коллекция КомандыПечати.
//
Процедура ПередДобавлениемКомандПечати(ИмяФормы, КомандыПечати, СтандартнаяОбработка) Экспорт
	
	//++ Локализация 
	//-- Локализация
	
КонецПроцедуры

// Дополнительные настройки списка команд печати в журналах документов.
//
// см. УправлениеПечатьюПереопределяемый.ПриПолученииНастроекСпискаКомандПечати()
//
Процедура ПриПолученииНастроекСпискаКомандПечати(НастройкиСписка) Экспорт
	
	//++ Локализация
	//-- Локализация
	
КонецПроцедуры

// Дополняет сведения о юр/физлице
//
// Параметры:
//  СписокПолей - Строка - список полей структуры ФормированиеПечатныхФорм.СведенияОЮрФизЛице
//
Процедура ДополнитьСведенияОЮрФизЛицеВСпискеПолей(СписокПолей) Экспорт
	//++ Локализация
	//-- Локализация
КонецПроцедуры

// Формирует сведения об указанном юридическом или физическом лице.
// К сведениям относятся: наименование, адрес, номер телефона, банковские реквизиты.
//
// Параметры: 
//  Сведения - Структура - собранные сведения.
//  Реквизиты - Структура - реквизиты ЮрФизЛице.
//  ЮрФизЛицо   - организация или физическое лицо, о котором собираются сведения.
//  ДатаПериода - дата, на которую выбираются сведения о ЮрФизЛице.
//
Процедура ДополнитьСведенияОЮрФизЛице(Сведения, Реквизиты, ЮрФизЛицо, ДатаПериода) Экспорт
	//++ Локализация
    Если ЗначениеЗаполнено(ЮрФизЛицо)
       И (ТипЗнч(ЮрФизЛицо) = Тип("СправочникСсылка.Организации")
    	ИЛИ ТипЗнч(ЮрФизЛицо) = Тип("СправочникСсылка.Контрагенты")) Тогда
    
    	Если ТипЗнч(ЮрФизЛицо) = Тип("СправочникСсылка.Организации") Тогда
    	ИначеЕсли ТипЗнч(ЮрФизЛицо) = Тип("СправочникСсылка.Контрагенты") Тогда
    		Сведения.Вставить("НалоговыйНомерВСтранеРегистрации", Реквизиты.НалоговыйНомер);
    		Сведения.Вставить("СтранаРегистрации", Реквизиты.СтранаРегистрации);
    	КонецЕсли;
        РеквизитЮрФизЛицо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЮрФизЛицо, "ЮрФизЛицо");
		Если РеквизитЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
			Сведения.Вставить("КодПоЕДРПОУ", Реквизиты.КодПоЕДРПОУ);
		ИначеЕсли РеквизитЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицоНеРезидент Тогда
			Сведения.Вставить("КодПоЕДРПОУ", Реквизиты.КодПоЕДРПОУ);
		Иначе
			Сведения.Вставить("КодПоДРФО", Реквизиты.КодПоЕДРПОУ);
        КонецЕсли;
    	
    КонецЕсли;
    
    //-- Локализация
КонецПроцедуры

// Дополняет сведения о банковском счете
//
// Параметры:
//  РеквизитыСчета - Структура - реквизиты счета
//  Сведения - Структура - собранные сведения.
//  БанковскийСчет - СправочникСсылка.БанковскиеСчетаОрганизаций - ссылка на счет.
//
Процедура ДополнитьСведенияОБанковскомСчете(РеквизитыСчета, Сведения, БанковскийСчет) Экспорт
	//++ Локализация
	//-- Локализация
КонецПроцедуры
 
// Дополняет окончание для адреса из контактной информации.
//
// Параметры:
//  Объект - СправочникСсылка, объект контактной информации.
//  Окончание - Строка - представление найденного адреса.
//
Процедура ДополнитьОкончаниеАдресаИзКонтактнойИнформации(Объект, Окончание) Экспорт
	//++ Локализация
	//-- Локализация
КонецПроцедуры

// Формирует форматную строку согласно "Унифицированному формату электронных банковских сообщений" для ее отображения в
// виде QR-кода.
// 
// Параметры:
// 	ТекстСтроки - Строка - Параметр, в котором возвращается строка для формирования QR-кода.
// 	ДанныеДокумента  - Структура - Содержит значения полей документа.
// 
Процедура СформироватьСтрокуВФорматеЭлектронныхБанковскихСообщений(ТекстСтроки, ДанныеДокумента) Экспорт
	//++ Локализация
	//-- Локализация
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьДанныеСтруктурыПолучателяПоТипуОбъекта(ПолноеИмяОбъектаМетаданных , СтруктураДанныхОбъектаПечати) Экспорт
	//++ Локализация
	//-- Локализация
КонецПроцедуры

#КонецОбласти
