
#Область ПрограммныйИнтерфейс

// Определяет следующие свойств регламентных заданий:
//  - зависимость от функциональных опций.
//  - возможность выполнения в различных режимах работы программы.
//  - прочие параметры.
//
// см. РегламентныеЗаданияПереопределяемый.ПриОпредеПриОпределенииНастроекРегламентныхЗаданий()
//
Процедура ПриОпределенииНастроекРегламентныхЗаданий(Настройки) Экспорт
	
	//++ Локализация
	
	//++ НЕ УТ
	//-- НЕ УТ
	
	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.НСИСОбновлениеДанных;
	Настройка.РаботаетСВнешнимиРесурсами = Истина;               


	
	//-- Локализация
	
КонецПроцедуры

#КонецОбласти
