
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Не ПроверитьНаличиеРоли() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("uk='Недостатньо прав для редагування';ru='Недостаточно прав на редактирование'"), , , , Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ПередЗаписьюНаСервере(Отказ);
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПроверитьНаличиеРоли()
	
	Возврат РольДоступна("ПолныеПрава");
	
КонецФункции

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ)
	
	Если Не ЯЯ_ВзаимодействиеССервисами.Выбрано(Объект.Наименование, "Наименование") Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Если Не ЯЯ_ВзаимодействиеССервисами.Выбрано(Объект, "Объект") Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПредопределенныеОбъекты.Родитель КАК Родитель,
	               |	ПредопределенныеОбъекты.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ПредопределенныеОбъекты КАК ПредопределенныеОбъекты
	               |ГДЕ
	               |	ПредопределенныеОбъекты.Ссылка <> &Ссылка
	               |	И ПредопределенныеОбъекты.Объект = &Объект";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("Объект", Объект.Объект);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Результат.Количество() > 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("uk='Вже існують посилання на цей самий об’єкт!';ru='Уже есть ссылки, ссылающиеся на этот же объект!'"), , , , Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
