#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ДляВсехСтрок( ЗначениеРазрешено(ФизическиеЛица.ФизическоеЛицо, NULL КАК ИСТИНА)
	|	) И ЗначениеРазрешено(Организация)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Возвращает описание состава документа
//
// Возвращаемое значение:
//  Структура - см. ЗарплатаКадрыСоставДокументов.НовоеОписаниеСоставаОбъекта.
Функция ОписаниеСоставаОбъекта() Экспорт
	
	МетаданныеДокумента = Метаданные.Документы.НачислениеОценочныхОбязательствПоОтпускам;
	Возврат ЗарплатаКадрыСоставДокументов.ОписаниеСоставаОбъектаПоМетаданнымФизическиеЛицаВТабличныхЧастях(МетаданныеДокумента);
	
КонецФункции

#Область ПрограммныйИнтерфейс


#КонецОбласти
	
#Область СлужебныеПроцедурыИФункции



#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	// Печать справки расчета резервов по оплате отпусков
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПФ_MXL_СправкаРасчетРезервовПоОплатеОтпусков";
	КомандаПечати.Представление = НСтр("ru='Справка-расчет резеров';uk='Довідка-розрахунок резервів'");
	КомандаПечати.МенеджерПечати = "Документ.НачислениеОценочныхОбязательствПоОтпускам";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
КонецПроцедуры

// Сформировать печатные формы объектов.
//
// ВХОДЯЩИЕ:
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать.
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы.
//   ОшибкиПечати          - Список значений  - Ошибки печати  (значение - ссылка на объект, представление - текст
//                           ошибки).
//   ОбъектыПечати         - Список значений  - Объекты печати (значение - ссылка на объект, представление - имя
//                           области в которой был выведен объект).
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "РасчетСреднегоЗаработка") Тогда
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		ДанныеДокументов = ДанныеДокументовДляПечатиРасчетаСреднегоЗаработка(ПараметрыПечати,,ПараметрыВывода.КодЯзыкаДляМногоязычныхПечатныхФорм);
		ТабличныйДокумент = Обработки.ПечатьРасчетаСреднегоЗаработка.ТабличныйДокументРасчетаСреднегоЗаработка(ДанныеДокументов, ОбъектыПечати, "РасчетСреднегоЗаработка", Истина, ПараметрыВывода);
		Если НЕ ТабличныйДокумент = Неопределено Тогда
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
				КоллекцияПечатныхФорм, 
				"РасчетСреднегоЗаработка", 
				НСтр("ru='Расчет среднего заработка';uk='Розрахунок середнього заробітку'"),
				ТабличныйДокумент,
				,
				,
				,
				Истина	// ЭтоМногоязычнаяПечатнаяФорма
			);
		КонецЕсли;
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_СправкаРасчетРезервовПоОплатеОтпусков") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"ПФ_MXL_СправкаРасчетРезервовПоОплатеОтпусков", 
		НСтр("ru='Справка расчет-резеров';uk='Довідка розрахунок-резерів'"),
		ПечатнаяФормаСправкаРасчетРезервов(УправлениеПечатью.МакетПечатнойФормы("Документ.НачислениеОценочныхОбязательствПоОтпускам.ПФ_MXL_СправкаРасчетРезервовПоОплатеОтпусков", 	ПараметрыВывода.КодЯзыкаДляМногоязычныхПечатныхФорм), МассивОбъектов, ОбъектыПечати, ПараметрыВывода.КодЯзыкаДляМногоязычныхПечатныхФорм),
		,
		"Документ.НачислениеОценочныхОбязательствПоОтпускам.ПФ_MXL_СправкаРасчетРезервовПоОплатеОтпусков",
		, 
		Истина // ЭтоМногоязычнаяПечатнаяФорма
		);
	КонецЕсли;

КонецПроцедуры

Функция ПечатнаяФормаСправкаРасчетРезервов(Макет, МассивОбъектов, ОбъектыПечати, КодЯзыка)
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.НачислениеОценочныхОбязательствПоОтпускам.ПФ_MXL_СправкаРасчетРезервовПоОплатеОтпусков",КодЯзыка);
	НастройкиПечатныхФорм = ЗарплатаКадрыПовтИсп.НастройкиПечатныхФорм();
	
	ДокументРезультат = Новый ТабличныйДокумент;
	ДокументРезультат.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_НачислениеОценочныхОбязательствПоОтпускам";
	ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ДокументРезультат.ПолеСверху = 5;
	ДокументРезультат.ПолеСЛева = 5;	
	ДокументРезультат.ПолеСправа =5;	
	ДокументРезультат.ПолеСнизу = 5;
	ДокументРезультат.АвтоМасштаб = Истина;
	ДокументРезультат.ТолькоПросмотр = Истина;
	
	НомерСтрокиНачало = ДокументРезультат.ВысотаТаблицы + 1;
	
	ДанныеДляПечати = ДанныеДляПечатиСправкиРасчетаРезервов(МассивОбъектов);
	
	ПервыйПриказ = Истина; 
	
	Для Каждого ДанныеПечати Из ДанныеДляПечати Цикл
		// Документы нужно выводить на разных страницах.
		Если Не ПервыйПриказ Тогда
			ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
		Иначе
			ПервыйПриказ = Ложь;
		КонецЕсли;
		
		ДанныеДокумента = ДанныеПечати.Значение;
		// таб. часть сотрудник
		ДанныеРасчетов = ДанныеПечати.Значение.ДанныеРасчетов;
		ДанныеРасчетов.Сортировать("Сотрудник Возр");
		// таб.часть подразделение
		ДанныеПодразделение = ДанныеРасчетов.Скопировать(,"Подразделение, ФОП,СтраховыеВзносы,ОстатокОтпуска,ОтпускАвансом,СуммаРезерва,СуммаРезерваИсчислено,СуммаРезерваНакоплено,СуммаРезерваСтраховыхВзносов,СуммаРезерваСтраховыхВзносовИсчислено,СуммаРезерваСтраховыхВзносовНакоплено");
		ДанныеПодразделение.Свернуть("Подразделение", "ФОП,СтраховыеВзносы,ОстатокОтпуска,ОтпускАвансом,СуммаРезерва,СуммаРезерваИсчислено,СуммаРезерваНакоплено,СуммаРезерваСтраховыхВзносов,СуммаРезерваСтраховыхВзносовИсчислено,СуммаРезерваСтраховыхВзносовНакоплено");
		ДанныеПодразделение.Сортировать("Подразделение Возр");
		//таб. часть итоги
		ДанныеИтог = ДанныеРасчетов.Скопировать(,"Ссылка, ФОП,СтраховыеВзносы,ОстатокОтпуска,ОтпускАвансом,СуммаРезерва,СуммаРезерваИсчислено,СуммаРезерваНакоплено,СуммаРезерваСтраховыхВзносов,СуммаРезерваСтраховыхВзносовИсчислено,СуммаРезерваСтраховыхВзносовНакоплено");
		ДанныеИтог.Свернуть("Ссылка", "ФОП,СтраховыеВзносы,ОстатокОтпуска,ОтпускАвансом,СуммаРезерва,СуммаРезерваИсчислено,СуммаРезерваНакоплено,СуммаРезерваСтраховыхВзносов,СуммаРезерваСтраховыхВзносовИсчислено,СуммаРезерваСтраховыхВзносовНакоплено");
		
		ФлагМетодОбязательств = ДанныеДокумента.Метод = Перечисления.МетодыНачисленияРезервовОтпусков.МетодОбязательств;
		
		//области печати 
		Если ФлагМетодОбязательств Тогда
			ОбластьШапкаЗаголовок = Макет.ПолучитьОбласть("ШапкаЗаголовок");
			ОбластьЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицыОб");
			ОбластьСтрокаПодразделение = Макет.ПолучитьОбласть("СтрокаПодразделение ");
			ОбластьСтрокаСотрудник = Макет.ПолучитьОбласть("СтрокаСотрудник ");
			ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
			ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
		Иначе
			ОбластьШапкаЗаголовок = Макет.ПолучитьОбласть("ШапкаЗаголовок|ШапкаНачалоНормативный");
			ОбластьШапкаЗаголовок_ПраваяЧасть = Макет.ПолучитьОбласть("ШапкаЗаголовок|ОсновнойРасчет");
			
			ОбластьШапкаДанныеМетода = Макет.ПолучитьОбласть("ШапкаДанныеМетода|ШапкаНачалоНормативный");
			ОбластьШапкаДанныеМетода_ПраваяЧасть = Макет.ПолучитьОбласть("ШапкаДанныеМетода|ОсновнойРасчет");
			
			ОбластьЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицыНорм|ШапкаНачалоНормативный");
			ОбластьЗаголовокТаблицы_ПраваяЧасть = Макет.ПолучитьОбласть("ЗаголовокТаблицыНорм|ОсновнойРасчет");
			
			ОбластьСтрокаПодразделение = Макет.ПолучитьОбласть("СтрокаПодразделение|ШапкаНачалоНормативный");
			ОбластьСтрокаПодразделение_ПраваяЧасть = Макет.ПолучитьОбласть("СтрокаПодразделение|ОсновнойРасчет");
			
			ОбластьСтрокаСотрудник = Макет.ПолучитьОбласть("СтрокаСотрудник|ШапкаНачалоНормативный");
			ОбластьСтрокаСотрудник_ПраваяЧасть = Макет.ПолучитьОбласть("СтрокаСотрудник|ОсновнойРасчет");
			
			ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы|ШапкаНачалоНормативный");
			ОбластьПодвалТаблицы_ПраваяЧасть = Макет.ПолучитьОбласть("ПодвалТаблицы|ОсновнойРасчет");
			
			ОбластьПодвал = Макет.ПолучитьОбласть("Подвал|ШапкаНачалоНормативный");
			ОбластьПодвал_ПраваяЧасть = Макет.ПолучитьОбласть("Подвал|ОсновнойРасчет");
		КонецЕсли;
		
		// заголовок
		ОбластьШапкаЗаголовок.Параметры.Заполнить(ДанныеДокумента);
		ОбластьШапкаЗаголовок.Параметры.НомерДокумента = КадровыйУчетРасширенный.НомерКадровогоПриказа(ДанныеДокумента.Номер);
		ОбластьШапкаЗаголовок.Параметры.ДатаДокумента = Формат(ДанныеДокумента.Дата, "ДЛФ=D");
		ОбластьШапкаЗаголовок.Параметры.МесяцНачисления = ЗарплатаКадрыКлиентСервер.ПолучитьПредставлениеМесяца(ДанныеДокумента.ПериодРегистрации,КодЯзыка);
		ОбластьШапкаЗаголовок.Параметры.Метод =	МультиязычностьУкр.ПолучитьЛокализованныйСинонимОбъекта(ОбластьШапкаЗаголовок.Параметры.Метод, КодЯзыка);
		// вывод
		ДокументРезультат.Вывести(ОбластьШапкаЗаголовок);
		
		//значения для метода
		Если Не ФлагМетодОбязательств Тогда
			ДокументРезультат.Присоединить(ОбластьШапкаЗаголовок_ПраваяЧасть);
			
			ОбластьШапкаДанныеМетода.Параметры.Заполнить(ДанныеДокумента);
			ДокументРезультат.Вывести(ОбластьШапкаДанныеМетода);
			ДокументРезультат.Присоединить(ОбластьШапкаДанныеМетода_ПраваяЧасть);
		КонецЕсли;
		
		//заголовок таблицы
		ДокументРезультат.Вывести(ОбластьЗаголовокТаблицы);
		Если Не ФлагМетодОбязательств Тогда
			ДокументРезультат.Присоединить(ОбластьЗаголовокТаблицы_ПраваяЧасть);
		Конецесли;
		
		Для Каждого СтрокаПодразделение Из ДанныеПодразделение Цикл
			// строка по подразделению
			ОбластьСтрокаПодразделение.Параметры.Заполнить(СтрокаПодразделение);
			Если НастройкиПечатныхФорм.ВыводитьПолнуюИерархиюПодразделений И ЗначениеЗаполнено(ОбластьСтрокаПодразделение.Параметры.Подразделение) Тогда
				ОбластьСтрокаПодразделение.Параметры.Подразделение = ОбластьСтрокаПодразделение.Параметры.Подразделение.ПолноеНаименование();
			КонецЕсли;
			ОбластьСтрокаПодразделение.Параметры.ТекущаяСтавкаСтраховыхВзносов_СтраховойВзнос = ?(Не ФлагМетодОбязательств, СтрокаПодразделение.СтраховыеВзносы,"");
				
			// повтор заголовка тч
			МассивМакетов = Новый Массив;
			МассивМакетов.Добавить(ОбластьСтрокаПодразделение);
			МассивМакетов.Добавить(ОбластьПодвалТаблицы);
			МассивМакетов.Добавить(ОбластьПодвал);
			Если НЕ ДокументРезультат.ПроверитьВывод(МассивМакетов) Тогда
				ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
				//заголовок таблицы
				ДокументРезультат.Вывести(ОбластьЗаголовокТаблицы);
				Если Не ФлагМетодОбязательств Тогда
					ДокументРезультат.Присоединить(ОбластьЗаголовокТаблицы_ПраваяЧасть);
				Конецесли;
				
			КонецЕсли;
			
			ДокументРезультат.Вывести(ОбластьСтрокаПодразделение);
			Если Не ФлагМетодОбязательств Тогда
				ОбластьСтрокаПодразделение_ПраваяЧасть.Параметры.Заполнить(СтрокаПодразделение);
				ДокументРезультат.Присоединить(ОбластьСтрокаПодразделение_ПраваяЧасть);
			КонецЕсли;
			Для Каждого СтрокаРасчет Из ДанныеРасчетов Цикл 
				// строка по сотруднику
				Если СтрокаПодразделение.Подразделение = СтрокаРасчет.Подразделение Тогда
					
					ОбластьСтрокаСотрудник.Параметры.Заполнить(СтрокаРасчет);
					Если Не НастройкиПечатныхФорм.ВыводитьПолныеФИОВСписочныхПечатныхФормах Тогда
						ОбластьСтрокаСотрудник.Параметры.ФИОПолные= ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ОбластьСтрокаСотрудник.Параметры.ФИОПолные);
					КонецЕсли;
					ОбластьСтрокаСотрудник.Параметры.ТабельныйНомер = ПрефиксацияОбъектовКлиентСервер.УдалитьПрефиксыИзНомераОбъекта(ОбластьСтрокаСотрудник.Параметры.ТабельныйНомер, Истина, Истина);
					ОбластьСтрокаСотрудник.Параметры.ТекущаяСтавкаСтраховыхВзносов_СтраховойВзнос = ?(Не ФлагМетодОбязательств, СтрокаРасчет.СтраховыеВзносы,СтрокаРасчет.ТекущаяСтавкаСтраховыхВзносов);
					
					// повтор заголовка тч
					МассивМакетов = Новый Массив;
					МассивМакетов.Добавить(ОбластьСтрокаСотрудник);
					МассивМакетов.Добавить(ОбластьПодвалТаблицы);
					МассивМакетов.Добавить(ОбластьПодвал);
					Если НЕ ДокументРезультат.ПроверитьВывод(МассивМакетов) Тогда
						ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
						//заголовок таблицы
						ДокументРезультат.Вывести(ОбластьЗаголовокТаблицы);
						Если Не ФлагМетодОбязательств Тогда
							ДокументРезультат.Присоединить(ОбластьЗаголовокТаблицы_ПраваяЧасть);
						Конецесли;
					КонецЕсли;
					
					ДокументРезультат.Вывести(ОбластьСтрокаСотрудник);
					Если Не ФлагМетодОбязательств Тогда
						ОбластьСтрокаСотрудник_ПраваяЧасть.Параметры.Заполнить(СтрокаРасчет);
						ДокументРезультат.Присоединить(ОбластьСтрокаСотрудник_ПраваяЧасть);
					Конецесли;
					
				Конецесли;
			КонецЦикла;			
		КонецЦикла;
			
		// подвал
		ОбластьПодвалТаблицы.Параметры.Заполнить(ДанныеИтог.Получить(0));
		ОбластьПодвалТаблицы.Параметры.ТекущаяСтавкаСтраховыхВзносов_СтраховойВзнос = ?(Не ФлагМетодОбязательств, ДанныеИтог.Получить(0).СтраховыеВзносы,"");
		Если ФлагМетодОбязательств Тогда
			ДокументРезультат.Вывести(ОбластьПодвалТаблицы);
			ОбластьПодвал.Параметры.Заполнить(ДанныеДокумента);
			ДокументРезультат.Вывести(ОбластьПодвал);
		Иначе
			ОбластьПодвалТаблицы_ПраваяЧасть.Параметры.Заполнить(ДанныеИтог.Получить(0));			
			ОбластьПодвал_ПраваяЧасть.Параметры.Заполнить(ДанныеДокумента);
			
			ДокументРезультат.Вывести(ОбластьПодвалТаблицы);
			ДокументРезультат.Присоединить(ОбластьПодвалТаблицы_ПраваяЧасть);			
			
			ДокументРезультат.Вывести(ОбластьПодвал);
			ДокументРезультат.Присоединить(ОбластьПодвал_ПраваяЧасть);
		КонецЕсли;
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ДокументРезультат, НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ключ);
  	КонецЦикла;	
	
	Возврат ДокументРезультат;
КонецФункции

Функция ДанныеДляПечатиСправкиРасчетаРезервов(МассивОбъектов)
		
	Запрос = Новый Запрос;
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	НачислениеОценочныхОбязательствПоОтпускам.Ссылка КАК Ссылка,
		|	НачислениеОценочныхОбязательствПоОтпускам.Ссылка.Дата КАК Дата,
		|	НачислениеОценочныхОбязательствПоОтпускам.Ссылка.Номер КАК Номер,
		|	НачислениеОценочныхОбязательствПоОтпускам.Ссылка.Организация КАК Организация,
		|	НачислениеОценочныхОбязательствПоОтпускам.Ссылка.ПериодРегистрации КАК ПериодРегистрации,
		|	ВЫБОР 
		|		КОГДА НачислениеОценочныхОбязательствПоОтпускам.Ссылка.ОбязательстваОтраженыВБухучете ТОГДА
		|			НачислениеОценочныхОбязательствПоОтпускам.Ссылка.Бухгалтер 
		|	ИНАЧЕ НачислениеОценочныхОбязательствПоОтпускам.Ссылка.Ответственный 
		|	КОНЕЦ КАК Исполнитель,
		|	НачислениеОценочныхОбязательствПоОтпускам.Ссылка.ДоляРасходов КАК ДоляРасходов
		|ПОМЕСТИТЬ ВТДанныеШапкиДокументов
		|ИЗ
		|	Документ.НачислениеОценочныхОбязательствПоОтпускам КАК НачислениеОценочныхОбязательствПоОтпускам
		|ГДЕ
		|	НачислениеОценочныхОбязательствПоОтпускам.Ссылка В(&МассивОбъектов)
		|	И НЕ НачислениеОценочныхОбязательствПоОтпускам.Ссылка.КорректировкаОбязательств
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НачислениеОценочныхОбязательствПоОтпускам.Ссылка КАК Ссылка,
		|	НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(НачислениеОценочныхОбязательствПоОтпускам.Ссылка.ПериодРегистрации, МЕСЯЦ, 1), МЕСЯЦ) КАК ДатаНачалаСобытия,
		|	НачислениеОценочныхОбязательствПоОтпускам.Сотрудник КАК Сотрудник,
		|	НачислениеОценочныхОбязательствПоОтпускам.НомерСтроки КАК НомерСтроки,
		|	НачислениеОценочныхОбязательствПоОтпускам.Подразделение КАК Подразделение,
		|	НачислениеОценочныхОбязательствПоОтпускам.ФОТ КАК ФОТ,
		|	НачислениеОценочныхОбязательствПоОтпускам.СтраховыеВзносы КАК СтраховыеВзносы,
		|	НачислениеОценочныхОбязательствПоОтпускам.ТекущаяСтавкаСтраховыхВзносов КАК ТекущаяСтавкаСтраховыхВзносов,
		|	НачислениеОценочныхОбязательствПоОтпускам.ОстатокОтпуска КАК ОстатокОтпуска,
		|	НачислениеОценочныхОбязательствПоОтпускам.ОтпускАвансом КАК ОтпускАвансом,
		|	НачислениеОценочныхОбязательствПоОтпускам.СреднийЗаработок КАК СреднийЗаработок,
		|	НачислениеОценочныхОбязательствПоОтпускам.СуммаРезерва КАК СуммаРезерва,
		|	НачислениеОценочныхОбязательствПоОтпускам.СуммаРезерваСтраховыхВзносов КАК СуммаРезерваСтраховыхВзносов,
		|	НачислениеОценочныхОбязательствПоОтпускам.СуммаРезерваНакоплено КАК СуммаРезерваНакоплено,
		|	НачислениеОценочныхОбязательствПоОтпускам.СуммаРезерваСтраховыхВзносовНакоплено КАК СуммаРезерваСтраховыхВзносовНакоплено,
		|	НачислениеОценочныхОбязательствПоОтпускам.СуммаРезерваИсчислено КАК СуммаРезерваИсчислено,
		|	НачислениеОценочныхОбязательствПоОтпускам.СуммаРезерваСтраховыхВзносовИсчислено КАК СуммаРезерваСтраховыхВзносовИсчислено
		|ПОМЕСТИТЬ ВТДанныеОтпусков
		|ИЗ
		|	ВТДанныеШапкиДокументов КАК ДанныеШапкиДокументов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.НачислениеОценочныхОбязательствПоОтпускам.РасчетРезерваОтпусков КАК НачислениеОценочныхОбязательствПоОтпускам
		|		ПО ДанныеШапкиДокументов.Ссылка = НачислениеОценочныхОбязательствПоОтпускам.Ссылка
		|ГДЕ
		|	НЕ НачислениеОценочныхОбязательствПоОтпускам.Ссылка.КорректировкаОбязательств
		|";
	
	Запрос.Выполнить();
	
	ОписательВременныхТаблиц = КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеСотрудников(
		Запрос.МенеджерВременныхТаблиц, "ВТДанныеОтпусков", "Сотрудник,ДатаНачалаСобытия");
	КадровыйУчет.СоздатьВТКадровыеДанныеСотрудников(ОписательВременныхТаблиц, Истина, "ФИОПолные,ТабельныйНомер,Подразделение,Должность");
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДанныеШапкиДокументов.Ссылка,
		|	ДанныеШапкиДокументов.Организация КАК Организация,
		|	ДанныеШапкиДокументов.Организация.НаименованиеПолное КАК ОрганизацияНаименованиеПолное,
		|	ДанныеШапкиДокументов.Организация.КодПоЕДРПОУ КАК ОрганизацияКодПоЕДРПОУ,
		|	ДанныеШапкиДокументов.Дата,
		|	ДанныеШапкиДокументов.Номер,
		|	ДанныеШапкиДокументов.ПериодРегистрации,
		|	ЕСТЬNULL(ДанныеШапкиДокументов.Исполнитель, """") КАК Исполнитель,
		|	"""" КАК ДолжностьИсполнителя,
		|	ДанныеШапкиДокументов.ДоляРасходов КАК ДоляРасходов
		|ИЗ
		|	ВТДанныеШапкиДокументов КАК ДанныеШапкиДокументов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеОтпусков.Ссылка КАК Ссылка,
		|	ДанныеОтпусков.НомерСтроки,
		|	ДанныеОтпусков.Сотрудник КАК Сотрудник,
		|	КадровыеДанныеСотрудников.ФИОПолные КАК ФИОПолные,
		|	КадровыеДанныеСотрудников.ТабельныйНомер,
		|	КадровыеДанныеСотрудников.Должность,
		|	ВЫБОР 
		|	 КОГДА ДанныеОтпусков.Подразделение = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
		|		ТОГДА КадровыеДанныеСотрудников.Подразделение
		|	ИНАЧЕ ДанныеОтпусков.Подразделение
		|	КОНЕЦ КАК Подразделение,
		|	ДанныеОтпусков.ФОТ КАК ФОП,
		|	ДанныеОтпусков.СтраховыеВзносы КАК СтраховыеВзносы,
		|	ДанныеОтпусков.ТекущаяСтавкаСтраховыхВзносов КАК ТекущаяСтавкаСтраховыхВзносов,
		|	ДанныеОтпусков.ОстатокОтпуска КАК ОстатокОтпуска,
		|	ДанныеОтпусков.ОтпускАвансом КАК ОтпускАвансом,
		|	ДанныеОтпусков.СреднийЗаработок КАК СреднийЗаработок,
		|	ДанныеОтпусков.СуммаРезерва КАК СуммаРезерва,
		|	ДанныеОтпусков.СуммаРезерваСтраховыхВзносов КАК СуммаРезерваСтраховыхВзносов,
		|	ДанныеОтпусков.СуммаРезерваНакоплено КАК СуммаРезерваНакоплено,
		|	ДанныеОтпусков.СуммаРезерваСтраховыхВзносовНакоплено КАК СуммаРезерваСтраховыхВзносовНакоплено,
		|	ДанныеОтпусков.СуммаРезерваИсчислено КАК СуммаРезерваИсчислено,
		|	ДанныеОтпусков.СуммаРезерваСтраховыхВзносовИсчислено КАК СуммаРезерваСтраховыхВзносовИсчислено
		|ИЗ
		|	ВТДанныеОтпусков КАК ДанныеОтпусков
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКадровыеДанныеСотрудников КАК КадровыеДанныеСотрудников
		|		ПО ДанныеОтпусков.ДатаНачалаСобытия = КадровыеДанныеСотрудников.Период
		|		   И ДанныеОтпусков.Сотрудник = КадровыеДанныеСотрудников.Сотрудник
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка,
		|	Подразделение,
		|	Сотрудник
		|";
		
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ТаблицаРасчетов = РезультатЗапроса[1].Выгрузить();
	
	ДанныеПечатныхФорм = Новый Соответствие;
	
	
	ШапкаДокумента = РезультатЗапроса[0].Выбрать();
	Пока ШапкаДокумента.Следующий() Цикл
		
		ДанныеДокумента = Новый Структура("Номер,Дата,ПериодРегистрации,ОрганизацияНаименованиеПолное,Метод,ДоляРасходов,ПредельнаяСумма,ИсполнительРасшифровкаПодписи");
		Отбор = Новый Структура("Организация", ШапкаДокумента.Организация);
		НастройкиРасчетаРезервовОтпусков = РегистрыСведений.НастройкиРасчетаРезервовОтпусков.СрезПоследних(ШапкаДокумента.ПериодРегистрации, Отбор);
		ЗаполнитьЗначенияСвойств(ДанныеДокумента, ШапкаДокумента);
		
		ДанныеДокумента.Метод = НастройкиРасчетаРезервовОтпусков[0].МетодНачисленияРезерваОтпусков;
		ДанныеДокумента.ПредельнаяСумма = НастройкиРасчетаРезервовОтпусков[0].ПредельнаяВеличинаОтчисленийВРезервОтпусков;
		ДанныеДокумента.ИсполнительРасшифровкаПодписи = ФизическиеЛицаЗарплатаКадры.РасшифровкаПодписи(ШапкаДокумента.Исполнитель);
		
		ДанныеРасчетов = ТаблицаРасчетов.Скопировать(Новый Структура("Ссылка", ШапкаДокумента.Ссылка));
		ДанныеДокумента.Вставить("ДанныеРасчетов", ДанныеРасчетов);
		
		ДанныеПечатныхФорм.Вставить(ШапкаДокумента.Ссылка, ДанныеДокумента);
		
	КонецЦикла; 
	
	Возврат ДанныеПечатныхФорм;
    
КонецФункции 

Функция ДанныеДокументовДляПечатиРасчетаСреднегоЗаработка(ПараметрыПечати ,ПоСтатьямФинансирования = Ложь,КодЯзыка) Экспорт
	
	ДатаНачалаСобытия = ПараметрыПечати.ДатаНачалаСобытия;
	Сотрудники = ПараметрыПечати.Сотрудники;
	МассивСсылок =  ПараметрыПечати.МассивСсылок;

	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	
	Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);
	Запрос.УстановитьПараметр("ДатаНачалаСобытия", ДатаНачалаСобытия);
	Запрос.УстановитьПараметр("Сотрудники", Сотрудники);
	
	СоздатьВТКадровыеДанныеСотрудниковДокумента(Запрос);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Документ.Сотрудник,
	|	&ДатаНачалаСобытия КАК ДатаНачалаСобытия,
	|	Документ.Ссылка КАК Ссылка,
	|	Документ.Ссылка.Организация,
	|	Документ.Ссылка.Дата КАК ДатаДокумента,
	|	Документ.Ссылка.Номер КАК НомерДокумента,
	|	ВТКадровыеДанныеСотрудников.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВТКадровыеДанныеСотрудников.ФИОПолные КАК ФИОПолные,
	|	ВТКадровыеДанныеСотрудников.ТабельныйНомер КАК ТабельныйНомер,
	|	ВТКадровыеДанныеСотрудников.Подразделение КАК Подразделение,
	|	ВТКадровыеДанныеСотрудников.Должность КАК Должность,
	|	ВТКадровыеДанныеСотрудников.ВидЗанятости КАК ВидЗанятости,
	|	Организации.Наименование КАК НаименованиеОрганизации,
	|	Организации.НаименованиеПолное КАК ПолноеНаименованиеОрганизации,
	|	Документ.Ссылка.Ответственный
	|ИЗ
	|	Документ.НачислениеОценочныхОбязательствПоОтпускам.РасчетРезерваОтпусков КАК Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыеДанныеСотрудников КАК ВТКадровыеДанныеСотрудников
	|		ПО Документ.Сотрудник = ВТКадровыеДанныеСотрудников.Сотрудник
	|			И ВТКадровыеДанныеСотрудников.Период = &ДатаНачалаСобытия
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО Документ.Ссылка.Организация = Организации.Ссылка
	|ГДЕ
	|	Документ.Сотрудник В(&Сотрудники) И
	|	Документ.Ссылка В(&МассивСсылок)
	|	";
	
	Результат = Запрос.Выполнить();
	//
	ДанныеДокументов = Новый Массив;
	
	Если Результат.Пустой() Тогда
		Возврат ДанныеДокументов;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ПериодРасчета = УчетСреднегоЗаработка.ПериодРасчетаОбщегоСреднегоЗаработкаСотрудникаДляРасчетаОценочныхОбязательств(Выборка.ДатаНачалаСобытия, Выборка.Сотрудник);
		ПорядокРасчета = ПредопределенноеЗначение("Перечисление.ПорядокРасчетаСреднегоЗаработкаОбщий.Постановление100Отпускные");
		СпособРасчета = ПредопределенноеЗначение("Перечисление.СпособыРасчетаНачислений.ОплатаОтпускаПоКалендарнымДням");
		ДанныеДокумента = Обработки.ПечатьРасчетаСреднегоЗаработка.ПустаяСтруктураДанныхДляПечатиСреднегоЗаработка(); 
		ЗаполнитьЗначенияСвойств(ДанныеДокумента.РеквизитыДокумента, Выборка);
		ДанныеДокумента.РеквизитыДокумента.ВидОтпуска = НСтр("ru='Отпуска для оц. обязательств';uk='Відпустки для оц. зобов''язань'",КодЯзыка);
		ЗаполнитьЗначенияСвойств(ДанныеДокумента.КадровыеДанныеСотрудника, Выборка);
		ДанныеДляРасчета = УчетСреднегоЗаработка.ДанныеДляРасчетаОбщегоСреднегоЗаработкаСотрудника(
			Выборка.Сотрудник, 
			Выборка.ДатаНачалаСобытия, 
			ПериодРасчета.ДатаНачала, 
			ПериодРасчета.ДатаОкончания, 
			ПорядокРасчета);
		//опредилим премии испл-емые в базовом периоде
		Если Выборка.ДатаНачалаСобытия >= Дата(2021,09,04) и ДанныеДляРасчета.Свойство("ДанныеОНачислениях") и ДанныеДляРасчета.Свойство("ДанныеОВремени")  Тогда
			РасшифровкаПремий 	= ПолучитьРасшифровкуПремии(ДанныеДляРасчета.ДанныеОНачислениях,ДанныеДляРасчета.ДанныеОВремени);
		КонецЕсли;
		ИспользоватьСреднеЧасовойЗаработок = Ложь;
		
		ДополнительныеПараметры = УчетСреднегоЗаработкаКлиентСервер.ДополнительныеПараметрыРасчетаСреднегоЗаработка();
		ДополнительныеПараметры.Индексации = ДанныеДляРасчета.ДанныеОбИндексации;
		ДополнительныеПараметры.ДатаНачалаСобытия = Выборка.ДатаНачалаСобытия;
		ДополнительныеПараметры.НачалоПериода = ПериодРасчета.ДатаНачала;
		ДополнительныеПараметры.ОкончаниеПериода = ПериодРасчета.ДатаОкончания;
		ДополнительныеПараметры.ПоЧасам = ИспользоватьСреднеЧасовойЗаработок;
		ДополнительныеПараметры.ПорядокРасчета = ПорядокРасчета;
		Если ИспользоватьСреднеЧасовойЗаработок Тогда
			ДанныеДокумента.РеквизитыДокумента.ВидУчетаВремениДляСредней = Перечисления.ВидыУчетаВремениДляСредней.ПоРабочимЧасам;
		КонецЕсли;
		ДанныеДокумента.ДанныеРасчетаСреднего = УчетСреднегоЗаработкаКлиентСервер.ДанныеДляРасчетаСреднегоЗаработка(
			ДанныеДляРасчета.ДанныеОНачислениях, 
			ДанныеДляРасчета.ДанныеОВремени, 
			ДополнительныеПараметры);
			
		Если Выборка.ДатаНачалаСобытия >= Дата(2021,09,04) Тогда
			Если РасшифровкаПремий.Количество()>0 Тогда
				ДанныеДокумента.Вставить("РасшифровкаПремий", 			);
				ДанныеДокумента.РасшифровкаПремий=РасшифровкаПремий;
			КонецЕсли;
		КонецЕсли;
		ДанныеДокумента.ПараметрыРасчета.ИспользоватьСреднеЧасовойЗаработок = ИспользоватьСреднеЧасовойЗаработок;
		ДанныеДокумента.ПараметрыРасчета.НачалоРасчетногоПериода = ПериодРасчета.ДатаНачала;
		ДанныеДокумента.ПараметрыРасчета.ОкончаниеРасчетногоПериода = ПериодРасчета.ДатаОкончания;
		
		ДанныеДокументов.Добавить(ДанныеДокумента);
	КонецЦикла;
	
	Возврат ДанныеДокументов;
	
КонецФункции

Процедура СоздатьВТКадровыеДанныеСотрудниковДокумента(Запрос)
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Документ.Сотрудник,
	|	&ДатаНачалаСобытия КАК Период
	|ПОМЕСТИТЬ ВТСотрудники
	|ИЗ
	|	Документ.НачислениеОценочныхОбязательствПоОтпускам.РасчетРезерваОтпусков КАК Документ
	|ГДЕ
	|	Документ.Ссылка В(&МассивСсылок)
	|	И Документ.Сотрудник В(&Сотрудники)";
	
	Запрос.Выполнить();
	
	Описатель = КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеСотрудников(Запрос.МенеджерВременныхТаблиц, "ВТСотрудники");
	КадровыйУчет.СоздатьВТКадровыеДанныеСотрудников(Описатель, Истина, "ФизическоеЛицо,ФИОПолные,ТабельныйНомер,Подразделение,Должность,ВидЗанятости");
	
	Запрос.Текст = "УНИЧТОЖИТЬ ВТСотрудники";
	Запрос.Выполнить();
	
КонецПроцедуры

Функция ПолучитьРасшифровкуПремии(ДанныеОНачислениях,ДанныеОВремени) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДанныеОНачислениях", ДанныеОНачислениях);
	Запрос.УстановитьПараметр("ДанныеОВремени", ДанныеОВремени);
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ДанныеОНачислениях.Сотрудник,
		|	ДанныеОНачислениях.ПорядокРасчета,
		|	ДанныеОНачислениях.СоставнаяЧасть,
		|	ДанныеОНачислениях.Период,
		|	ДанныеОНачислениях.Сумма,
		|	ДанныеОНачислениях.ДатаНачалаБазовогоПериода,
		|	ДанныеОНачислениях.СуммаПремии,
		|	ДанныеОНачислениях.ОтработаноДнейВБазовомПериоде,
		|	ДанныеОНачислениях.НормаДнейВБазовомПериоде,
		|	ДанныеОНачислениях.КоличествоМесяцев
		|ПОМЕСТИТЬ ВТДанныеОНачислениях
		|ИЗ
		|	&ДанныеОНачислениях КАК ДанныеОНачислениях
		|ГДЕ
		|	ДанныеОНачислениях.СуммаПремии >0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеОВремени.Сотрудник,
		|	ДанныеОВремени.ПорядокРасчета,
		|	ДанныеОВремени.Период,
		|	ДанныеОВремени.ОтработаноДней
		|ПОМЕСТИТЬ ВТДанныеОВремени
		|ИЗ
		|	&ДанныеОВремени КАК ДанныеОВремени
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТДанныеОНачислениях.Сотрудник,
		|	ВТДанныеОНачислениях.СоставнаяЧасть,
		|	ВТДанныеОНачислениях.ПорядокРасчета,
		|	ВТДанныеОНачислениях.Период,
		|	ВТДанныеОНачислениях.Сумма,
		|	ВТДанныеОНачислениях.СуммаПремии,
		|	ВТДанныеОНачислениях.ДатаНачалаБазовогоПериода,
		|	ВТДанныеОНачислениях.КоличествоМесяцев,
		|	ВТДанныеОНачислениях.ОтработаноДнейВБазовомПериоде,
		|	ВТДанныеОНачислениях.НормаДнейВБазовомПериоде,
		|	ВТДанныеОВремени.ОтработаноДней
		|ИЗ
		|	ВТДанныеОНачислениях КАК ВТДанныеОНачислениях
		|   ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеОВремени КАК ВТДанныеОВремени
		|   ПО ВТДанныеОНачислениях.Сотрудник = ВТДанныеОВремени.Сотрудник
		|   И ВТДанныеОНачислениях.ПорядокРасчета = ВТДанныеОВремени.ПорядокРасчета
		|	И ВТДанныеОНачислениях.Период = ВТДанныеОВремени.Период";
	
	Запрос.Текст = ТекстЗапроса;
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

#КонецОбласти

Функция ТребуетсяУтверждениеДокументаБухгалтером(Организация = Неопределено) Экспорт
	
	// Подтверждение требуется, если используется обмен с бухгалтерией.
	
	// ЗарплатаКадрыПриложения.ОбменЗарплата30Бухгалтерия21
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ОбменЗарплата30Бухгалтерия21")
		И Не ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.КонфигурацииЗарплатаКадры") Тогда
		
		Модуль = ОбщегоНазначения.ОбщийМодуль("ОбменДаннымиЗарплата30Бухгалтерия21");
		Возврат Модуль.ОбменИспользуется(Организация);
		
	КонецЕсли;
	// Конец ЗарплатаКадрыПриложения.ОбменЗарплата30Бухгалтерия21
	
	Возврат Ложь;
	
КонецФункции

Процедура ЗаполнитьНачислениеОценочныхОбязательствПоОтпускам(ПараметрыЗаполнения, АдресХранилища) Экспорт
	
	ЭтотОбъект = ПараметрыЗаполнения.Объект;
	РезервОтпусков.ЗаполнитьДокументНачислениеОценочныхОбязательствПоОтпускам(ЭтотОбъект);
	
	Результат = Новый Структура("ЗаданиеВыполнено, Объект, ИмяТаблицы", Истина, ЭтотОбъект, ПараметрыЗаполнения.ИмяТаблицы);
	ПоместитьВоВременноеХранилище(Результат, АдресХранилища);

КонецПроцедуры

Процедура ПеречитатьОценочныеОбязательства(ПараметрыЗаполнения, АдресХранилища) Экспорт
	
	ЭтотОбъект = ПараметрыЗаполнения.Объект;
	РезервОтпусков.ПеречитатьОценочныеОбязательства(ЭтотОбъект);
	
	Результат = Новый Структура("ЗаданиеВыполнено, Объект, ИмяТаблицы", Истина, ЭтотОбъект, ПараметрыЗаполнения.ИмяТаблицы);
	ПоместитьВоВременноеХранилище(Результат, АдресХранилища);

КонецПроцедуры

#КонецОбласти

#КонецЕсли