
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	
	УстановитьВидимостьСубконто();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьСубконто()
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаИУправлениеПерсоналом") Тогда
		Элементы.ГруппаБухгалтерскийУчет.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПриИзменении(Элемент)
	УстановитьВидимостьСубконто();
КонецПроцедуры
