
#Область ПрограммныйИнтерфейс

// Определяет разделы, в которых доступна команда вызова дополнительных обработок.
// В Разделы необходимо добавить метаданные тех разделов,
// в которых размещены команды вызова.
// 
// см. ДополнительныеОтчетыИОбработкиПереопределяемый.ОпределитьРазделыСДополнительнымиОбработками()
//
Процедура ОпределитьРазделыСДополнительнымиОбработками(Разделы) Экспорт
	
	//++ Локализация
	
	Если ПолучитьФункциональнуюОпцию("БазоваяВерсия") Тогда
		
		
	Иначе
		
		//++ НЕ УТ
		ОбщегоНазначенияУТ.ДобавитьПодсистемуВКоллекцию(Разделы, "Кадры");
		ОбщегоНазначенияУТ.ДобавитьПодсистемуВКоллекцию(Разделы, "Зарплата");
		//-- НЕ УТ
	КонецЕсли;
	//-- Локализация
	
КонецПроцедуры

#КонецОбласти
