#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВариантыОтчетов

// См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиОтчета.ОпределитьНастройкиФормы = Истина;
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "СправкаРасчетРезервыОтпусков");
	НастройкиВарианта.Описание =
		НСтр("ru='Подробный расчет резерва отпусков в разрезе сотрудников.';uk='Детальний розрахунок резерву відпусток у розрізі співробітників.'");
		
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ОстаткиОборотыРезервовОтпусков");
	НастройкиВарианта.Описание =
		НСтр("ru='Сводные данные об остатках и оборотах резервов отпусков.';uk='Зведені дані про залишки та обороти резервів відпусток.'");
		
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВариантыОтчетов

#КонецОбласти

#КонецОбласти

#КонецЕсли