
#Область ПрограммныйИнтерфейс

#Область ФункцииПолученияЗначенийПоУмолчанию

// Получает организацию, если она одна в ИБ
// Если переданная в качестве параметра организация уже заполнена - возвращает ее.
// Если организация не передана в качестве параметра или передана пустая,
// возвращает единственную в информационной базе организацию. Если организация
// в базе не одна - возвращает пустую ссылку на организацию.
//
// Параметры:
//   Организация - СправочникСсылка.Организации - Организация, которую нужно заполнить.
//
// Возвращаемое значение:
//   СправочникСсылка.Организации - организация по умолчанию.
//
Функция ПолучитьОрганизациюПоУмолчанию(Знач Организация = Неопределено) Экспорт

	Если Не ЗначениеЗаполнено(Организация) Тогда
		Возврат Справочники.Организации.ПолучитьОрганизациюПоУмолчанию();
	Иначе
		Возврат Организация;
	КонецЕсли;
	
КонецФункции


#КонецОбласти

#Область ДоступКРеквизитамОбъектовМетаданных

// Возвращает перечень реквизитов справочника, недоступных для изменения текущему пользователю.
//
// Параметры:
//		ИмяСправочника - Строка - имя справочника как оно задано в метаданных
//		ЭтоГруппа - Булево - проверять реквизиты группы или элемента справочника
//		НепроверяемыеРеквизиты - Строка - перечень реквизитов, которые могут быть "законно" изменены программно, при записи элемента
// Возвращаемое значение:
//		Строка - список недоступных реквизитов, разделенных запятыми.
//
Функция НедоступныеДляРедактированияРеквизитыСправочника(ИмяСправочника, ЭтоГруппа = Ложь, НепроверяемыеРеквизиты = "") Экспорт
	
	Реквизиты = "";
	
	Если Пользователи.ЭтоПолноправныйПользователь() Тогда
		Возврат Реквизиты; // все реквизиты доступны для редактирования
	КонецЕсли;
	
	МетаданныеСправочника = Метаданные.Справочники[ИмяСправочника];
	ИсключаемыеРеквизиты  = Новый Структура(
		"Предопределенный,Ссылка,ЭтоГруппа" + ?(ПустаяСтрока(НепроверяемыеРеквизиты), "", "," + НепроверяемыеРеквизиты));
	
	Для Каждого МетаданныеРеквизита Из МетаданныеСправочника.СтандартныеРеквизиты Цикл
		Если НЕ ИсключаемыеРеквизиты.Свойство(МетаданныеРеквизита.Имя)
		 И НЕ ПравоДоступа("Редактирование", МетаданныеСправочника,, МетаданныеРеквизита.Имя) Тогда
			Реквизиты = Реквизиты + ?(ПустаяСтрока(Реквизиты), "", ",") + МетаданныеРеквизита.Имя;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого МетаданныеРеквизита Из МетаданныеСправочника.Реквизиты Цикл
		Если НЕ ЭтоГруппа И МетаданныеРеквизита.Использование = Метаданные.СвойстваОбъектов.ИспользованиеРеквизита.ДляГруппы
		 ИЛИ ЭтоГруппа И МетаданныеРеквизита.Использование = Метаданные.СвойстваОбъектов.ИспользованиеРеквизита.ДляЭлемента Тогда
			Продолжить; // реквизит не используется
		КонецЕсли;
		Если НЕ ИсключаемыеРеквизиты.Свойство(МетаданныеРеквизита.Имя)
		 И НЕ ПравоДоступа("Редактирование", МетаданныеРеквизита) Тогда
			Реквизиты = Реквизиты + ?(ПустаяСтрока(Реквизиты), "", ",") + МетаданныеРеквизита.Имя;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Реквизиты;
	
КонецФункции

// Возвращает структуру реквизитов справочника.
//
// Параметры:
//		ИмяСправочника - Строка - имя справочника как оно задано в метаданных
// Возвращаемое значение:
//		Структура - стандартные и обычные реквизиты справочника.
//
Функция РеквизитыСправочника(ИмяСправочника) Экспорт
	
	СтруктураРеквизитов   = Новый Структура;
	МетаданныеСправочника = Метаданные.Справочники[ИмяСправочника];
	
	Для Каждого Реквизит Из МетаданныеСправочника.СтандартныеРеквизиты Цикл
		СтруктураРеквизитов.Вставить(Реквизит.Имя, Реквизит.Синоним);
	КонецЦикла;
	
	Для Каждого Реквизит Из МетаданныеСправочника.Реквизиты Цикл
		СтруктураРеквизитов.Вставить(Реквизит.Имя, Реквизит.Синоним);
	КонецЦикла;
	
	Возврат СтруктураРеквизитов;
	
КонецФункции

#КонецОбласти

#Область ФункцииПолученияНастроек

Функция ПолучитьДатуНачалаПереходаНаСтандартIBAN() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	НайденноеЗначение = Константы.ДатаНачалаПереходаНаСтандартIBAN.Получить();
	Если НЕ ЗначениеЗаполнено(НайденноеЗначение) Тогда
		НайденноеЗначение = '20190805';
	КонецЕсли;
	
	Возврат НайденноеЗначение;
	
КонецФункции

Функция ПолучитьДатуОкончанияПереходаНаСтандартIBAN() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	НайденноеЗначение = Константы.ДатаОкончанияПереходаНаСтандартIBAN.Получить();
	Если НЕ ЗначениеЗаполнено(НайденноеЗначение) Тогда
		НайденноеЗначение = '20200112';
	КонецЕсли;
	
	Возврат НайденноеЗначение;
	
КонецФункции

#КонецОбласти


#КонецОбласти
