
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	УправлениеЭлементами();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_НаборКонстант" Тогда
		// Изменены настройки программы в панелях администрирования
		УправлениеЭлементами();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область ОбщиеСправочники

&НаКлиенте
Процедура ОткрытьКассуККМ(Команда)
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСклад(Команда)
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОрганизацию(Команда)
	
	ОткрытьФорму("Справочник.Организации.ФормаОбъекта", Новый Структура("Ключ", Организация()));
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСвойствоБанковскийСчет(Команда)
	

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСвойствоКасса(Команда)
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВалюту(Команда)
	
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеЭлементами()

	// Функциональные опции
	ИспользоватьНесколькоОрганизаций     = ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоОрганизаций");
	
	// Право чтения
	ПравоДоступаОрганизации = ПравоДоступа("Просмотр", Метаданные.Справочники.Организации);
	
	//БанковскийСчетИКасса
	//Для БЗК
	Элементы.ГруппаНастроекБанковскиеСчета.Видимость = Ложь;
	Элементы.ГруппаНастроекКассы.Видимость           = Ложь;
	
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"СведенияОбОрганизации", "Видимость", Не ИспользоватьНесколькоОрганизаций И ПравоДоступаОрганизации);
	
	//Для БЗК
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ГруппаВалюты", "Видимость", Ложь);
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ГруппаНастройкаСкладскогоУчета", "Видимость", Ложь);
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ГруппаНастройкаКассыККМ", "Видимость", Ложь);
	
	ЕстьДанныеДляОтображения = Элементы.ГруппаОрганизации.Видимость
		ИЛИ Элементы.ГруппаНастроекБанковскиеСчета.Видимость
		ИЛИ Элементы.ГруппаНастроекКассы.Видимость
		ИЛИ Элементы.ГруппаВалюты.Видимость
		ИЛИ Элементы.ГруппаНастройкаСкладскогоУчета.Видимость
		ИЛИ Элементы.ГруппаНастройкаКассыККМ.Видимость;
		
	Если ЕстьДанныеДляОтображения Тогда
		Элементы.ГруппаНеУстановленыНеобходимыеНастройки.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#Область Прочее


&НаСервереБезКонтекста
Функция Организация()
	Возврат Справочники.Организации.ПолучитьОрганизациюПоУмолчанию();
КонецФункции


#КонецОбласти

#КонецОбласти
