
Функция ПолучитьОтвет(ПараметрыЗапроса) Экспорт
	
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("СтрокаHTML", "");
	СтруктураОтвета.Вставить("НаличиеОшибок", Ложь);
	СтруктураОтвета.Вставить("ТекстОшибки", "");
	
	// Проверить параметры запроса
	ТипЗапроса = ПараметрыЗапроса.ТипЗапроса;
	
	Параметры = ПолучитьПараметры();
	
	Токен = Параметры.Токен;
	Сервер = Параметры.Сервер;
	
	ПараметрыРесурса = Новый Структура;
	ПараметрыРесурса.Вставить("ТипЗапроса", ТипЗапроса);
	ПараметрыРесурса.Вставить("Токен", Токен);
	
	Ресурс = ПолучитьРесурс(ПараметрыРесурса, ПараметрыЗапроса);
	
	Если Не ЗначениеЗаполнено(Ресурс) Тогда
		
		ТекстОшибки = "Не найден метод " + ПараметрыЗапроса.ТипЗапроса;
		
		СтруктураОтвета.Вставить("НаличиеОшибок", Истина);
		СтруктураОтвета.Вставить("ТекстОшибки", ТекстОшибки);
		
		Возврат СтруктураОтвета;
		
	КонецЕсли;
	
	Соединение = Новый HTTPСоединение(Сервер, 443 , , , , , Новый ЗащищенноеСоединениеOpenSSL());
	Запрос = Новый HTTPЗапрос(Ресурс);
	
	Результат = Соединение.Получить(Запрос);
	
	Если Результат.КодСостояния = 200 Тогда
		
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(Результат.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8));
		МассивДанных = ПрочитатьJSON(ЧтениеJSON);
		ЧтениеJSON.Закрыть();
		
		Возврат ПолучитьСтруктуруОтвета(ПараметрыЗапроса, МассивДанных, СтруктураОтвета);
		
	ИначеЕсли Результат.КодСостояния = 403 Тогда
		
		ТекстОшибки = "Неправильный токен доступа. Код состояния: 403";
		
		СтруктураОтвета.Вставить("НаличиеОшибок", Истина);
		СтруктураОтвета.Вставить("ТекстОшибки", ТекстОшибки);
		
		Возврат СтруктураОтвета;
		
	ИначеЕсли Результат.КодСостояния = 404 Тогда
		
		ТекстОшибки = "Сервис не найден. Код состояния: 404";
		
		СтруктураОтвета.Вставить("НаличиеОшибок", Истина);
		СтруктураОтвета.Вставить("ТекстОшибки", ТекстОшибки);
		
		Возврат СтруктураОтвета;
		
	ИначеЕсли Результат.КодСостояния = 503 Тогда
		
		ТекстОшибки = "Сервис не доступен. Код состояния: 503";
		
		СтруктураОтвета.Вставить("НаличиеОшибок", Истина);
		СтруктураОтвета.Вставить("ТекстОшибки", ТекстОшибки);
		
		Возврат СтруктураОтвета;
		
	Иначе
		
		ТекстОшибки = "Возникла ошибка. Код состояния: " + Результат.КодСостояния;
		
		СтруктураОтвета.Вставить("НаличиеОшибок", Истина);
		СтруктураОтвета.Вставить("ТекстОшибки", ТекстОшибки);
		
		Возврат СтруктураОтвета;
		
	КонецЕсли;
	
КонецФункции

Функция ПолучитьРесурс(ПараметрыРесурса, ПараметрыЗапроса)
	
	Ресурс = "";
	
	Если ПараметрыРесурса.ТипЗапроса = "fop" Тогда
		Если ПараметрыЗапроса.Свойство("code") Тогда
			Ресурс = "/api/v2/fop/" + ПараметрыЗапроса.code + "?apiKey=" + ПараметрыРесурса.Токен;
		КонецЕсли;
	ИначеЕсли ПараметрыРесурса.ТипЗапроса = "" Тогда
		Ресурс = "";
	ИначеЕсли ПараметрыРесурса.ТипЗапроса = "statistics" Тогда
		Ресурс = "/api/v2/statistics" + "?apiKey=" + ПараметрыРесурса.Токен;
	ИначеЕсли ПараметрыРесурса.ТипЗапроса = "company" Тогда
		Если ПараметрыЗапроса.Свойство("code") Тогда
			Ресурс = "/api/v2/company/" + ПараметрыЗапроса.code + "?apiKey=" + ПараметрыРесурса.Токен;
		КонецЕсли;
	ИначеЕсли ПараметрыРесурса.ТипЗапроса = "" Тогда
		Ресурс = "";
	КонецЕсли;
	
	Возврат Ресурс;
	
КонецФункции

Функция ПолучитьСтруктуруОтвета(ПараметрыЗапроса, МассивДанных, СтруктураОтвета)
	
	СтрокаHTML = "<html>
	|<head>
	|</head>
	|<body>";
	
	Если ПараметрыЗапроса.ТипЗапроса = "fop" Тогда
		
		СтрокаHTML = СтрокаHTML + "
		|<b>Назва: </b>" + МассивДанных.full_name + "
		|<br>
		|<br>
		|<b>Вид діяльності: </b>" + МассивДанных.activities + "
		|<br>
		|<br>
		|<b>Додаткові види діяльності: </b>";
		
		Для Каждого Элемент Из МассивДанных.additionally_activities Цикл
			
			СтрокаHTML = СтрокаHTML + "
			|<ul>
			|	<li>" + Элемент + "</li>
			|</ul>";
			
		КонецЦикла;
		
		СтрокаHTML = СтрокаHTML + "
		|<b>Дата народження: </b>" + МассивДанных.birth_date + "
		|<br>
		|<br>
		|<b>Ідентифікаційний код: </b>" + МассивДанных.code + "
		|<br>
		|<br>
		|<b>Email: </b>" + МассивДанных.email + "
		|<br>
		|<br>
		|<b>Дата оновлення: </b>" + МассивДанных.last_date + "
		|<br>
		|<br>
		|<b>Адреса: </b>" + МассивДанных.location + "
		|<br>
		|<br>
		|<b>Код платника ПДВ: </b>" + МассивДанных.pdv_code + "
		|<br>
		|<br>
		|<b>Статус платника ПДВ: </b>" + МассивДанных.pdv_status + "
		|<br>
		|<br>
		|<b>Телефони: </b>" + МассивДанных.pdv_status + "
		|<ul>";
		
		Для Каждого Элемент Из МассивДанных.phones Цикл
			СтрокаHTML = СтрокаHTML + "
			|	<li>" + Элемент + "</li>";
		КонецЦикла;
		
		СтрокаHTML = СтрокаHTML + "
		|</ul>
		|<b>Дата реєстрації: </b>" + МассивДанных.registration_date + "
		|<br>
		|<br>
		|<b>Номер реєстрації: </b>" + МассивДанных.registration_number + "
		|<br>
		|<br>
		|<b>Стать: </b>" + МассивДанных.sex + "
		|<br>
		|<br>
		|<b>Статус: </b>" + МассивДанных.status + "
		|<br>
		|<br>";
		
		Если МассивДанных.tax_debts.Количество() = 0 Тогда
			СтрокаHTML = СтрокаHTML + "
			|<b>Податкові заборгованості: </b>" + "Заборгованість відсутня";
		Иначе
			СтрокаHTML = СтрокаHTML + "
			|<b>Податкові заборгованості: </b>
			|<ul>
			|	<li>Опис: " + МассивДанных.tax_debts.text + "</li>
			|	<li>Зображення: " + МассивДанных.tax_debts.icon + "</li>
			|	<li>Загалом: " + МассивДанных.tax_debts.total + "</li>
			|	<li>Місцевий: " + МассивДанных.tax_debts.local + "</li>
			|	<li>Державний: " + МассивДанных.tax_debts.government + "</li>
			|	<li>Дата оновлення: " + МассивДанных.tax_debts.database_date + "</li>
			|	<li>Тип: " + МассивДанных.tax_debts.type + "</li>
			|</ul>
			|<br>";
		КонецЕсли;
		
		СтруктураОтвета.Вставить("ПолноеНаименование", МассивДанных.full_name + " ФОП");
		
	ИначеЕсли ПараметрыЗапроса.ТипЗапроса = "statistics" Тогда
		
		Для Каждого Элемент Из МассивДанных Цикл
			
			СтрокаHTML = СтрокаHTML + "
			|<b>" + Элемент.Ключ + ":</b>
			|<ul>
			|	<li>" + "Назва        " + "<b>" + Элемент.Значение.name + "</b></li>
			|	<li>" + "Обмеження    " + "<b>" + Элемент.Значение.limit + "</b></li>
			|	<li>" + "Використано  " + "<b>" + Элемент.Значение.used + "</b></li>
			|	<li>" + "Залишок      " + "<b>" + Элемент.Значение.balance + "</b></li>
			|</ul>";
			
		КонецЦикла;
		
	ИначеЕсли ПараметрыЗапроса.ТипЗапроса = "company" Тогда
		
		МассивДанных = МассивДанных[0];
		
		СтрокаHTML = СтрокаHTML + "
		|<b>Вид деятельности: </b>" + МассивДанных.activities + "
		|<br>
		|<br>
		|<b>Директор: </b>" + МассивДанных.ceo_name + "
		|<br>
		|<br>
		|<b>ЕГРПОУ: </b>" + МассивДанных.code + "
		|<br>
		|<br>
		|<b>Дата обновления: </b>" + МассивДанных.database_date + "
		|<br>
		|<br>
		|<b>Полное наименование: </b>" + МассивДанных.full_name + "
		|<br>
		|<br>
		|<b>Адрес: </b>" + МассивДанных.location + "
		|<br>
		|<br>
		|<b>ИНН: </b>" + МассивДанных.pdv_code + "
		|<br>
		|<br>
		|<b>Состояние: </b>" + МассивДанных.pdv_status + "
		|<br>
		|<br>
		|<b>Короткое наименование: </b>" + МассивДанных.short_name + "
		|<br>
		|<br>
		|<b>Статус: </b>" + МассивДанных.status + "
		|<br>
		|<br>
		|<b>Собственники: </b>";
		
		Для Каждого ТекСтрока Из МассивДанных.beneficiaries Цикл
			СтрокаHTML = СтрокаHTML + "<br>" + ТекСтрока.title + " " + "<b>" + ТекСтрока.capital + " грн"+ "</b>";
		КонецЦикла;
		
		СтруктураОтвета.Вставить("ПолноеНаименование", МассивДанных.full_name);
		
	Иначе
		
		ТекстОшибки = "Не найден метод " + ПараметрыЗапроса.ТипЗапроса;
		
		СтруктураОтвета.Вставить("НаличиеОшибок", Истина);
		СтруктураОтвета.Вставить("ТекстОшибки", ТекстОшибки);
		
	КонецЕсли;
	
	СтрокаHTML =  СтрокаHTML + "
	|</body>
	|</html>";
	
	СтруктураОтвета.Вставить("СтрокаHTML", СтрокаHTML);
	
	Возврат СтруктураОтвета;
	
КонецФункции

Функция ПолучитьПараметры()
	
	СтруктураРесурсов = Новый Структура;
	СтруктураРесурсов.Вставить("Токен", "pfPXMHUTVs6f");
	СтруктураРесурсов.Вставить("Сервер", "opendatabot.com");
	
	Возврат СтруктураРесурсов;
	
КонецФункции


////////////////////////////////////////////////////////////////////////////////
// Предопределенные объекты

// Функция предназначена для получения ссылки на предопределенный объект
//
// Параметры:
//  Параметр - 	 Наименование элемента (Строка или СправочникСсылка.ПредопределенныеОбъекты)
//  Родитель - 	 Родитель
// 
// Возвращаемое значение:
//  Ссылка на предопределенный объект или НЕОПРЕДЕЛЕНО
//
Функция ПолучитьПредопределенныйОбъект(Параметр, Родитель = Неопределено) Экспорт
	
	Если ТипЗнч(Параметр) = Тип("Строка") Тогда
		Наименование = Параметр;
		Ссылка = Справочники.ПредопределенныеОбъекты.НайтиПоНаименованию(Наименование, Истина, Родитель);
	ИначеЕсли ТипЗнч(Параметр) = Тип("СправочникСсылка.ПредопределенныеОбъекты") Тогда
		Наименование = Параметр.Наименование;
		Ссылка = Параметр;
	КонецЕсли;
	
	Если НЕ ЯЯ_ВзаимодействиеССервисами.Выбрано(Ссылка) Тогда
		Сообщить("ВНИМАНИЕ! Не найден предопределенный объект " + Наименование + " - сообщите разработчикам!", СтатусСообщения.Внимание);
	ИначеЕсли НЕ ЯЯ_ВзаимодействиеССервисами.Выбрано(Ссылка.Объект) Тогда
		Сообщить("ВНИМАНИЕ! Не найден предопределенный объект " + Наименование + " - сообщите разработчикам!", СтатусСообщения.Внимание);
	КонецЕсли;
	
	Возврат Ссылка.Объект;
	
КонецФункции

// Функция предназначена для получения значения свойства объекта в общем модуле
//
// Параметры:
//  Объект				 - Объект значения свойств объекта
//  ИмяСвойства			 - Имя свойства объекта
//  ЗначениеПоУмолчанию	 - Значение по-умолчанию объекта
// 
// Возвращаемое значение:
//  Значение свойства объекта 
//
Функция ПолучитьЗначениеСвойства(Объект, ИмяСвойства, ЗначениеПоУмолчанию = Неопределено) Экспорт
	
	Если ЗначениеПоУмолчанию = Неопределено тогда
		ЗначениеПоУмолчанию = Справочники.ЗначенияСвойствОбъектов.ПустаяСсылка();
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ Значение ИЗ РегистрСведений.ЗначенияСвойствОбъектов ГДЕ Свойство.Наименование=&ИмяСвойства И Объект=&Объект");
	Запрос.УстановитьПараметр("Объект", Объект);
	Запрос.УстановитьПараметр("ИмяСвойства", ИмяСвойства);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Возврат ?(НЕ Результат.Следующий(), ЗначениеПоУмолчанию, Результат.Значение);
	
КонецФункции

// Функция - аналог использования функции ЗначениеЗаполнено с модификацией
//
// Параметры:
//  Значение			 - Объект проверки
//  ТекстПредупреждения	 - Текст предупреждения для пользователей
//  НомерСтроки			 - Номер строки проверки
//  Отказ				 - Отказ
//  Предупреждать		 - Признак вывода предупреждения или сообщения (Истина вызывает метод Предупредить(); Ложь вызывает метод Сообщить() )
// 
// Возвращаемое значение:
//  Результат - Истина/Ложь
//
Функция Выбрано(Значение, ТекстПредупреждения = Неопределено, НомерСтроки = 0, Отказ = Ложь, Предупреждать = Ложь) Экспорт
	
	Результат = Истина;
	ТипЗначения = ТипЗнч(Значение);
	
	// Сначала примитивные типы
	Если Значение = Неопределено ИЛИ Значение = NULL Тогда
		Результат = Ложь;
	ИначеЕсли ТипЗначения=Тип("Булево") Тогда
		Результат = Истина;
	ИначеЕсли ТипЗначения=Тип("Число") 
		Тогда Если Значение = 0 Тогда 
			Результат = Ложь;
		КонецЕсли;
	ИначеЕсли ТипЗначения=Тип("Строка") Тогда
		Если СокрЛП(Значение)="" Тогда
			Результат = Ложь;
		КонецЕсли;
	ИначеЕсли ТипЗначения=Тип("Дата") Тогда
		Если Значение=Дата('00010101') Тогда
			Результат = Ложь;
		КонецЕсли;
	#Если Клиент Тогда
	ИначеЕсли ТипЗначения = Тип("ПолеВвода") И НЕ Выбрано(Значение.Значение) Тогда
		Результат = Ложь;
	#КонецЕсли
	
	// Для остальных будем считать значение пустым, если оно равно дефолтному значению своего типа
	Иначе
		Попытка
			Если Значение = Новый(ТипЗначения) Тогда
				Результат = Ложь;
			КонецЕсли;
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	Если Результат = Ложь Тогда
		Если ТекстПредупреждения <> Неопределено тогда
			#Если Клиент Тогда
			Если Предупреждать тогда
				ПоказатьПредупреждение(, "Не заполнено поле '" + ТекстПредупреждения + "'" + ?(НомерСтроки=0,""," в строке № " + НомерСтроки) + " !");
			Иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено поле '"+ТекстПредупреждения+"'"+?(НомерСтроки=0,""," в строке № "+НомерСтроки)+" !", СтатусСообщения.Важное);
			КонецЕсли;
			#КонецЕсли
		КонецЕсли;
		Отказ = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции


////////////////////////////////////////////////////////////////////////////////
// Интеграция с Telegram-бот

// Процедура отправки сообщения по Telegram
//
Процедура ОтправитьСообщениеTelegram(Пользователь, ТекстСообщения, СтилизованныйТекст = Ложь, ОтображатьСсылки = Ложь, IDСообщенияДляОтвета = 0, Клавиатура = "") Экспорт
	
	СтруктураПараметровПодключения = ПолучитьПараметрыПодключенияTelegram(Пользователь, Ложь);
	
	Если Не ЗначениеЗаполнено(СтруктураПараметровПодключения.НомерЧата) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыЗапроса = "?chat_id=" + Формат(СтруктураПараметровПодключения.НомерЧата, "ЧГ=0") + "&text=" + ТекстСообщения;
	
	Если СтилизованныйТекст = Истина Тогда
		ПараметрыЗапроса = ПараметрыЗапроса + "&parse_mode=Markdown";
	КонецЕсли;
	
	Если ОтображатьСсылки = Истина Тогда
		ПараметрыЗапроса = ПараметрыЗапроса + "&disable_web_page_preview=True";
	КонецЕсли;
	
	Если IDСообщенияДляОтвета > 0 Тогда
		ПараметрыЗапроса = ПараметрыЗапроса + "&reply_to_message_id=" + Формат(IDСообщенияДляОтвета, "ЧГ=0");
	КонецЕсли;
	
	Если ПустаяСтрока(Клавиатура) Тогда 
		ПараметрыЗапроса = ПараметрыЗапроса + "&reply_markup=" + ПолучитьЗакрытуюКлавиатуру();
	Иначе
		ПараметрыЗапроса = ПараметрыЗапроса + "&reply_markup="+Клавиатура;
	КонецЕсли;
	
	Ресурс = "bot" + СтруктураПараметровПодключения.Токен + "/sendMessage" + ПараметрыЗапроса;
	Соединение = Новый HTTPСоединение(СтруктураПараметровПодключения.Сервер, 443,,,,,Новый ЗащищенноеСоединениеOpenSSL());
	Запрос = Новый HTTPЗапрос(Ресурс);
	Запрос.УстановитьТелоИзСтроки(ПараметрыЗапроса);
	Ответ = Соединение.ОтправитьДляОбработки(Запрос);
	
КонецПроцедуры

// Процедура отправки сообщения по Telegram
//
Процедура ОтправитьСообщениеTelegramПоChatID(НомерЧата, ТекстСообщения, СтилизованныйТекст = Ложь, ОтображатьСсылки = Ложь, IDСообщенияДляОтвета = 0, Клавиатура = "") Экспорт
	
	Если Не ЗначениеЗаполнено(НомерЧата) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыЗапроса = "?chat_id=" + Формат(НомерЧата, "ЧГ=0") + "&text=" + ТекстСообщения;
	
	Если СтилизованныйТекст = Истина Тогда
		ПараметрыЗапроса = ПараметрыЗапроса + "&parse_mode=Markdown";
	КонецЕсли;
	
	Если ОтображатьСсылки = Истина Тогда
		ПараметрыЗапроса = ПараметрыЗапроса + "&disable_web_page_preview=True";
	КонецЕсли;
	
	Если IDСообщенияДляОтвета > 0 Тогда
		ПараметрыЗапроса = ПараметрыЗапроса + "&reply_to_message_id=" + Формат(IDСообщенияДляОтвета, "ЧГ=0");
	КонецЕсли;
	
	Если Не ПустаяСтрока(Клавиатура) Тогда 
		ПараметрыЗапроса = ПараметрыЗапроса + "&reply_markup="+Клавиатура;
	КонецЕсли;
	
	Ресурс = "bot" + ЯЯ_ВзаимодействиеССервисами.ПолучитьПредопределенныйОбъект("ТокенTelegram") + "/sendMessage" + ПараметрыЗапроса;
	Соединение = Новый HTTPСоединение(ЯЯ_ВзаимодействиеССервисами.ПолучитьПредопределенныйОбъект("СерверTelegram"), 443,,,,,Новый ЗащищенноеСоединениеOpenSSL());
	Запрос = Новый HTTPЗапрос(Ресурс);
	Запрос.УстановитьТелоИзСтроки(ПараметрыЗапроса);
	Ответ = Соединение.ОтправитьДляОбработки(Запрос);
	
КонецПроцедуры

// Процедура отправки сообщения по Telegram
//
Процедура ИзменитьКлавиатуру(НомерЧата, НомерСообщения, Клавиатура) Экспорт
	
	Токен = ЯЯ_ВзаимодействиеССервисами.ПолучитьПредопределенныйОбъект("ТокенTelegram");
	Сервер = ЯЯ_ВзаимодействиеССервисами.ПолучитьПредопределенныйОбъект("СерверTelegram");
	
	Ресурс = "bot" + Токен + "/editMessageReplyMarkup?chat_id=" + НомерЧата + "&message_id=" + НомерСообщения + "&reply_markup=" + Клавиатура;
	Соединение = Новый HTTPСоединение(Сервер, 443,,,,,Новый ЗащищенноеСоединениеOpenSSL());
	Запрос = Новый HTTPЗапрос(Ресурс);
	Ответ = Соединение.ОтправитьДляОбработки(Запрос);
	
КонецПроцедуры

// Функция возращяет параметры подключения к Телеграм
//
Функция ПолучитьПараметрыПодключенияTelegram(Пользователь, ОтправлятьАдминистратору = Истина)
	
	СтруктураПодключения = Новый Структура("Токен, НомерЧата, Сервер");
	
	Если ЗначениеЗаполнено(Пользователь) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Подключения.chat_id КАК ChatID
		|ИЗ
		|	РегистрСведений.ПодключенияTelegram КАК Подключения
		|ГДЕ
		|	Подключения.Пользователь = &Пользователь
		|	И Подключения.Актуальность = ИСТИНА
		|	И Подключения.АутентификацияПройдена = ИСТИНА";
		
		Запрос.УстановитьПараметр("Пользователь", Пользователь);
		
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			Если ОтправлятьАдминистратору Тогда
				СтруктураПодключения.Вставить("НомерЧата", ЯЯ_ВзаимодействиеССервисами.ПолучитьПредопределенныйОбъект("НомерЧатаАдминистратораTelegram"));
			Иначе
				Возврат СтруктураПодключения;
			КонецЕсли;
		Иначе
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				СтруктураПодключения.Вставить("НомерЧата", Выборка.ChatID);
			КонецЦикла;
		КонецЕсли;
		
	Иначе
		Если ОтправлятьАдминистратору Тогда
			СтруктураПодключения.Вставить("НомерЧата", ЯЯ_ВзаимодействиеССервисами.ПолучитьПредопределенныйОбъект("НомерЧатаАдминистратораTelegram"));
		Иначе
			Возврат СтруктураПодключения;
		КонецЕсли;
	КонецЕсли;
	
	СтруктураПодключения.Вставить("Токен", ЯЯ_ВзаимодействиеССервисами.ПолучитьПредопределенныйОбъект("ТокенTelegram"));
	СтруктураПодключения.Вставить("Сервер", ЯЯ_ВзаимодействиеССервисами.ПолучитьПредопределенныйОбъект("СерверTelegram"));
	
	Возврат СтруктураПодключения;
	
КонецФункции

// Процедура отправки файлов по Telegram
//
Процедура ОтправитьФайл(Пользователь, chat_id, Параметр)
	
	Если Параметр.ИмяФайла = "" Тогда
		Возврат;
	КонецЕсли;
	
	ИмяФайла = Параметр.ИмяФайла;
	НазваниеФайла = Параметр.НазваниеФайла;
	
	СтруктураПараметровПодключения = ПолучитьПараметрыПодключенияTelegram(Пользователь);
	
	СтрокаСоединения = "/bot" + СтруктураПараметровПодключения.Токен + "/sendDocument";
	
	Boundary = "----"+Строка(Новый УникальныйИдентификатор());
	
	//Определяем массив для процедуры ОбъединитьФайлы
	МассивФайловДляОбъединения = Новый Массив;
	
	//Формируем начальный фрагмент файла POST-запроса
	ИмяФайлаОтправкиНачало = ПолучитьИмяВременногоФайла("txt");
	ФайлОтправкиНачало = Новый ЗаписьТекста(ИмяФайлаОтправкиНачало, КодировкаТекста.UTF8);
	
	//Формируем конечный фрагмент файла POST-запроса
	ИмяФайлаОтправкиКонец = ПолучитьИмяВременногоФайла("txt");
	ФайлаОтправкиКонец = Новый ЗаписьТекста(ИмяФайлаОтправкиКонец, КодировкаТекста.UTF8);
	
	ТекстДляОтправки = "";
	
	ТекстДляОтправки = ТекстДляОтправки + "--"+Boundary + Символы.ПС;
	ТекстДляОтправки = ТекстДляОтправки + "Content-Disposition: form-data; name=""chat_id""" + Символы.ПС + Символы.ПС;
	ТекстДляОтправки = ТекстДляОтправки + Формат(chat_id, "ЧГ=0") + Символы.ПС;
	
	ТекстДляОтправки = ТекстДляОтправки + "--"+Boundary + Символы.ПС;
	ТекстДляОтправки = ТекстДляОтправки + "Content-Disposition: form-data; name=""document""; filename=""" + НазваниеФайла + ".pdf" + """" + Символы.ПС;
	
	ФайлОтправкиНачало.ЗаписатьСтроку(ТекстДляОтправки );
	ФайлОтправкиНачало.Закрыть();
	
	МассивФайловДляОбъединения.Добавить(ИмяФайлаОтправкиНачало);
	
	МассивФайловДляОбъединения.Добавить(СокрЛП(ИмяФайла));
	
	ТекстДляОтправки = "" + Символы.ПС;
	ТекстДляОтправки = ТекстДляОтправки + "--"+Boundary+"--";
	ФайлаОтправкиКонец.ЗаписатьСтроку(ТекстДляОтправки);
	ФайлаОтправкиКонец.Закрыть();
	МассивФайловДляОбъединения.Добавить(ИмяФайлаОтправкиКонец);
	
	ИмяФайлаОтправки = ПолучитьИмяВременногоФайла("txt");
	ОбъединитьФайлы(МассивФайловДляОбъединения, ИмяФайлаОтправки);
	
	HTTPЗапрос = Новый HTTPЗапрос;
	Заголовки = Новый Соответствие;
	
	HTTPЗапрос.Заголовки.Вставить("Connection", "keep-alive");
	HTTPЗапрос.Заголовки.Вставить("Content-Type", "multipart/form-data; boundary="+Boundary);
	
	HTTPЗапрос.УстановитьИмяФайлаТела(ИмяФайлаОтправки);
	HTTPЗапрос.АдресРесурса = СтрокаСоединения;
	
	//ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL(Новый СертификатКлиентаWindows, Новый СертификатыУдостоверяющихЦентровWindows);
	HTTPСоединение = Новый HTTPСоединение(СтруктураПараметровПодключения.Сервер,,,,,, Новый ЗащищенноеСоединениеOpenSSL());
	
	Попытка
		ОтветHTTP = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

// Процедура отправки тестового файла по Telegram
//
Процедура ОтправитьТестовыйФайл(chat_id, Параметр) Экспорт
	
	ИмяФайла = ПолучитьИмяВременногоФайла("txt");
	
	Таб = Новый ТабличныйДокумент;
	Таб.Записать(ИмяФайла);
	
	СтрокаСоединения = "/bot" + ЯЯ_ВзаимодействиеССервисами.ПолучитьПредопределенныйОбъект("ТокенTelegram") + "/sendDocument";
	
	Boundary = "----"+Строка(Новый УникальныйИдентификатор());
	
	//Определяем массив для процедуры ОбъединитьФайлы
	МассивФайловДляОбъединения = Новый Массив;
	
	//Формируем начальный фрагмент файла POST-запроса
	ИмяФайлаОтправкиНачало = ПолучитьИмяВременногоФайла("txt");
	ФайлОтправкиНачало = Новый ЗаписьТекста(ИмяФайлаОтправкиНачало, КодировкаТекста.UTF8);
	
	//Формируем конечный фрагмент файла POST-запроса
	ИмяФайлаОтправкиКонец = ПолучитьИмяВременногоФайла("txt");
	ФайлаОтправкиКонец = Новый ЗаписьТекста(ИмяФайлаОтправкиКонец, КодировкаТекста.UTF8);
	
	ТекстДляОтправки = "";
	
	ТекстДляОтправки = ТекстДляОтправки + "--"+Boundary + Символы.ПС;
	ТекстДляОтправки = ТекстДляОтправки + "Content-Disposition: form-data; name=""chat_id""" + Символы.ПС + Символы.ПС;
	ТекстДляОтправки = ТекстДляОтправки + chat_id + Символы.ПС;
	
	ТекстДляОтправки = ТекстДляОтправки + "--"+Boundary + Символы.ПС;
	ТекстДляОтправки = ТекстДляОтправки + "Content-Disposition: form-data; name=""document""; filename=""report.txt""" + Символы.ПС;
	
	ФайлОтправкиНачало.ЗаписатьСтроку(ТекстДляОтправки );
	ФайлОтправкиНачало.Закрыть();
	
	МассивФайловДляОбъединения.Добавить(ИмяФайлаОтправкиНачало);
	
	МассивФайловДляОбъединения.Добавить(СокрЛП(ИмяФайла));
	
	ТекстДляОтправки = "" + Символы.ПС;
	ТекстДляОтправки = ТекстДляОтправки + "--"+Boundary+"--";
	ФайлаОтправкиКонец.ЗаписатьСтроку(ТекстДляОтправки);
	ФайлаОтправкиКонец.Закрыть();
	МассивФайловДляОбъединения.Добавить(ИмяФайлаОтправкиКонец);
	
	ИмяФайлаОтправки = ПолучитьИмяВременногоФайла("txt");
	ОбъединитьФайлы(МассивФайловДляОбъединения, ИмяФайлаОтправки);
	
	HTTPЗапрос = Новый HTTPЗапрос;
	Заголовки = Новый Соответствие;
	
	HTTPЗапрос.Заголовки.Вставить("Connection", "keep-alive");
	HTTPЗапрос.Заголовки.Вставить("Content-Type", "multipart/form-data; boundary="+Boundary);
	
	HTTPЗапрос.УстановитьИмяФайлаТела(ИмяФайлаОтправки);
	HTTPЗапрос.АдресРесурса = СтрокаСоединения;
	HTTPСоединение = Новый HTTPСоединение(ЯЯ_ВзаимодействиеССервисами.ПолучитьПредопределенныйОбъект("СерверTelegram"), 443,,,,, Новый ЗащищенноеСоединениеOpenSSL());
	
	Попытка
		ОтветHTTP = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

// Процедура получение сообщений по Telegram
//
Процедура ПоказатьСообщение(Смещение = 0, КоличествоОбновлений = 100, Таймаут = 0) Экспорт
	
	Если Смещение > 0 Тогда
		ПараметрыЗапроса = "?offset="+Формат(Смещение, "ЧГ=0");
	КонецЕсли;
	
	Если Не КоличествоОбновлений = 100 Тогда
		Если ЗначениеЗаполнено(ПараметрыЗапроса) Тогда
			ПараметрыЗапроса = "&limit="+Формат(КоличествоОбновлений, "ЧГ=0");
		Иначе 
			ПараметрыЗапроса = "?limit="+Формат(КоличествоОбновлений, "ЧГ=0");
		КонецЕсли;
	КонецЕсли;
	
	Если Таймаут > 0 Тогда 
		Если ЗначениеЗаполнено(ПараметрыЗапроса) Тогда
			ПараметрыЗапроса = "&timeout="+Формат(Таймаут, "ЧГ=0");
		Иначе
			ПараметрыЗапроса = "?timeout="+Формат(Таймаут, "ЧГ=0");
		КонецЕсли;
	КонецЕсли;
	
	Токен = ПолучитьПредопределенныйОбъект("ТокенTelegram");
	Сервер = ПолучитьПредопределенныйОбъект("СерверTelegram");
	
	Ресурс = "bot" + Токен + "/getUpdates" + ПараметрыЗапроса;
	Соединение  =  Новый HTTPСоединение(Сервер,443,,,,,Новый ЗащищенноеСоединениеOpenSSL());
	Запрос = Новый HTTPЗапрос(Ресурс);
	Ответ = Соединение.Получить(Запрос);
	ДвоичныеДанныеОтвета = Ответ.ПолучитьТелоКакДвоичныеДанные();
	
	ПрочитатьДвоичныеДанныеОтвета(ДвоичныеДанныеОтвета);
	
КонецПроцедуры

// функция выдает строковое представление существующих команд
//
Функция СписокКоманд(Пользователь)
	
	ТаблицаПонимаемыхКоманд = ПолучитьТаблицуПонимаемыхКоманд(Пользователь);
	
	СтрВозврата = "";
	
	Для Каждого Стр Из ТаблицаПонимаемыхКоманд Цикл
		Если Стр.Выводить Тогда
			СтрВозврата = СтрВозврата + ?(СтрВозврата <> "", Символы.ПС, "") + Стр.Имя + " - " + Стр.Описание;
		КонецЕсли;
	КонецЦикла;
	
	Возврат СтрВозврата;
	
КонецФункции

// Процедура получения двоичных данных ответа и сормирования дерева значений
//
Процедура ПрочитатьДвоичныеДанныеОтвета(ДвоичныеДанныеОтвета)
	
	ИмяФайла = ПолучитьИмяВременногоФайла("tgm");
	ДвоичныеДанныеОтвета.Записать(ИмяФайла);
	ДеревоЗн = Новый ДеревоЗначений;
	ЧтениеJSON = Новый ЧтениеJSON();
	ЧтениеJSON.ОткрытьФайл(ИмяФайла);
	СтрДерево = ДеревоЗн;
	Пока ЧтениеJSON.Прочитать() Цикл
		СтрДерево = СформироватьДерево(ДеревоЗн, СтрДерево, ЧтениеJSON,, Ложь);
	КонецЦикла;
	ЧтениеJSON.Закрыть();
	
	ЗаполнитьДанные(ДеревоЗн);
	
КонецПроцедуры

Функция СформироватьДерево(ДеревоЗн, СтрДерево, ЧтениеJSON, Знач ИмяКолонки = Неопределено, Прочитать = Истина)
	
	Если Прочитать Тогда
		ЧтениеJSON.Прочитать();
	КонецЕсли;
	TипJSON = ЧтениеJSON.ТипТекущегоЗначения;
	Если TипJSON = ТипЗначенияJSON.НачалоОбъекта ИЛИ TипJSON = ТипЗначенияJSON.НачалоМассива Тогда
		НовСтр = СтрДерево.Строки.Добавить();
		Возврат СформироватьДерево(ДеревоЗн, НовСтр, ЧтениеJSON);
	ИначеЕсли TипJSON = ТипЗначенияJSON.ИмяСвойства Тогда
		Возврат СформироватьДерево(ДеревоЗн, СтрДерево, ЧтениеJSON, ЧтениеJSON.ТекущееЗначение);
	ИначеЕсли TипJSON = ТипЗначенияJSON.Число ИЛИ TипJSON = ТипЗначенияJSON.Строка ИЛИ TипJSON = ТипЗначенияJSON.Булево ИЛИ TипJSON = ТипЗначенияJSON.Null Тогда 
		Если ДеревоЗн.Колонки.Найти(ИмяКолонки) = Неопределено Тогда
			ДеревоЗн.Колонки.Добавить(ИмяКолонки);
		КонецЕсли;
		СтрДерево[ИмяКолонки] = ЧтениеJSON.ТекущееЗначение;
		Возврат СформироватьДерево(ДеревоЗн, СтрДерево, ЧтениеJSON);
	ИначеЕсли TипJSON = ТипЗначенияJSON.Комментарий Тогда
		Если ДеревоЗн.Колонки.Найти("Комментарий") = Неопределено Тогда
			ДеревоЗн.Колонки.Добавить("Комментарий");
		КонецЕсли;
		СтрДерево.Комментарий = ЧтениеJSON.ТекущееЗначение;
		Возврат СформироватьДерево(ДеревоЗн, СтрДерево, ЧтениеJSON);
	ИначеЕсли СтрДерево <> Неопределено Тогда
		Возврат СтрДерево.Родитель;
	КонецЕсли;
	
КонецФункции

// Процедура заполнения регистра сведений команд и их инициализация
//
Процедура ЗаполнитьДанные(ДеревоЗн)
	
	Для Каждого СтрокаОк Из ДеревоЗн.Строки Цикл // oк
		
		Для Каждого СтрокаНовая Из СтрокаОк.Строки Цикл//
			
			Для Каждого СтрокаОбновление Из СтрокаНовая.Строки Цикл // update_id
				
				Для Каждого СтрокаСообщение Из СтрокаОбновление.Строки Цикл // message_id
					
					date = СтрокаСообщение.date;
					Команда = СокрЛП(СтрокаСообщение.text);
					Параметр = "";
					
					Попытка
						data = СтрокаСообщение.data;
						chat_instance = СтрокаСообщение.chat_instance;
					Исключение
						data = "";
						chat_instance = "";
					КонецПопытки;
					
					ПозицияПараметра = Найти(Команда, " ");
					
					Если ПозицияПараметра <> 0 Тогда
						Параметр = СокрЛП(Сред(Команда, ПозицияПараметра + 1));
						Команда = Лев(Команда, ПозицияПараметра - 1);
					КонецЕсли;
					
					Для Каждого СтрокаИнфо Из СтрокаСообщение.Строки Цикл // message_id
						
						chat_id = СтрокаИнфо.id;
						
						Если ЗначениеЗаполнено(chat_id) И chat_id > 0 Тогда
							
							НаборЗаписей = РегистрыСведений.КомандыПользователей.СоздатьНаборЗаписей();
							НаборЗаписей.Отбор.chat_id.Установить(chat_id);
							НаборЗаписей.Отбор.date.Установить(date);
							НаборЗаписей.Прочитать();
							
							Если НаборЗаписей.Количество() > 0 Тогда
								
								Для Каждого Запись Из НаборЗаписей Цикл
									Если НЕ Запись.Выполнено Тогда
										Запись.Выполнено = ВыполнитьКомандуБота(Запись);
										НаборЗаписей.Записать();
									КонецЕсли;
								КонецЦикла;
								
								НаборЗаписей = Неопределено;
								
							Иначе
								
								НаборЗаписейЗ = РегистрыСведений.КомандыПользователей.СоздатьМенеджерЗаписи();
								НаборЗаписейЗ.chat_id = chat_id;
								НаборЗаписейЗ.date = date;
								НаборЗаписейЗ.Команда = Команда;
								НаборЗаписейЗ.Параметр = Параметр;
								НаборЗаписейЗ.Выполнено = ВыполнитьКомандуБота(НаборЗаписейЗ);
								НаборЗаписейЗ.Записать();
								
							КонецЕсли;
							
							Если ЗначениеЗаполнено(chat_instance) И ЗначениеЗаполнено(data) Тогда
								
								СтрокаСобытий = СтрокаСообщение.Строки[1];
								date = СтрокаСобытий.date;
								message_id = СтрокаСобытий.message_id;
								
								Команда = СокрЛП(data);
								ПозицияПараметра = Найти(Команда, " ");
								
								Если ПозицияПараметра <> 0 Тогда
									Параметр = СокрЛП(Сред(Команда, ПозицияПараметра + 1));
									Команда = Лев(Команда, ПозицияПараметра - 1);
								КонецЕсли;
								
								НаборЗаписей = РегистрыСведений.КомандыПользователей.СоздатьНаборЗаписей();
								НаборЗаписей.Отбор.chat_id.Установить(chat_id);
								НаборЗаписей.Отбор.date.Установить(date);
								НаборЗаписей.Прочитать();
								
								Если НаборЗаписей.Количество() > 0 Тогда
									
									Для Каждого Запись Из НаборЗаписей Цикл
										Если НЕ Запись.Выполнено Тогда
											Запись.Выполнено = ВыполнитьКомандуБота(Запись);
											НаборЗаписей.Записать();
										КонецЕсли;
									КонецЦикла;
									
									НаборЗаписей = Неопределено;
									
								Иначе
									
									НаборЗаписейЗ = РегистрыСведений.КомандыПользователей.СоздатьМенеджерЗаписи();
									НаборЗаписейЗ.chat_id = chat_id;
									НаборЗаписейЗ.date = date;
									НаборЗаписейЗ.Команда = Команда;
									НаборЗаписейЗ.Параметр = Параметр;
									НаборЗаписейЗ.Выполнено = ВыполнитьКомандуБота(НаборЗаписейЗ);
									НаборЗаписейЗ.Записать();
									
									ОсновнойМассив = Новый Массив;
									МассивКнопок = Новый Массив;
									МассивКнопок.Добавить(Новый Структура("text, callback_data", "Выбрано: " + Параметр, "Выбор сделан"));
									ОсновнойМассив.Добавить(МассивКнопок);
									Клавиатура = ПолучитьКлавиатуру(ОсновнойМассив);
									
									ИзменитьКлавиатуру(Формат(chat_id, "ЧГ=0"), Формат(message_id, "ЧГ=0"), Клавиатура);
									
								КонецЕсли;
								
							КонецЕсли;
							
							Прервать;
							
						КонецЕсли;
						
					КонецЦикла;
					
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла
	
КонецПроцедуры

// Функция определяет пользователя системы по номеру чата
//
Функция ПолучитьПользовательПоChatID(chat_id) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПодключенияTelegram.Пользователь КАК Пользователь,
		|	ПодключенияTelegram.Актуальность,
		|	ПодключенияTelegram.АутентификацияПройдена
		|ИЗ
		|	РегистрСведений.ПодключенияTelegram КАК ПодключенияTelegram
		|ГДЕ
		|	ПодключенияTelegram.chat_id = &НомерЧата";
	
	Запрос.УстановитьПараметр("НомерЧата", chat_id);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Если Выборка.Актуальность И Выборка.АутентификацияПройдена Тогда
			Возврат Выборка.Пользователь;
		ИначеЕсли Не Выборка.Актуальность Тогда
			ТекстСообщения = "Текущий пользователь заблокирован. Обратитесь к администратору системы.";
		ИначеЕсли Выборка.Актуальность И Не Выборка.АутентификацияПройдена Тогда
			ТекстСообщения = ":( Неопознанная ошибка. Обратитесь к администратору системы.";
		КонецЕсли;
		
	Иначе 
		
		ТекстСообщения = "Текущий пользователь не зарегистрирован. Необходимо пройти процедуру регистрации.
		|Для этого необходимо отправить команду /RegMail и указать корпоративную почту.
		|Пример команды: /RegMail v.pupkin@brsm-nafta.com";
		
	КонецЕсли;
	
	ОтправитьСообщениеTelegramПоChatID(chat_id, ТекстСообщения);
	
	Возврат Неопределено;
	
КонецФункции

// Функция определяет пользователя системы по номеру чата
//
Функция ПолучитьChatIDПоПользователю(Пользователь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПодключенияTelegram.chat_id КАК НомерЧата
		|ИЗ
		|	РегистрСведений.ПодключенияTelegram КАК ПодключенияTelegram
		|ГДЕ
		|	ПодключенияTelegram.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Возврат Выборка.НомерЧата;
		
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

// функция возращяет таблицу значений понимающих команд
//
Функция ПолучитьТаблицуПонимаемыхКоманд(Пользователь)
	
	ТаблицаПонимаемыхКоманд = Новый ТаблицаЗначений;
	
	ОписаниеСтроки = Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(200));
	
	ТаблицаПонимаемыхКоманд.Колонки.Добавить("Имя", 				ОписаниеСтроки);
	ТаблицаПонимаемыхКоманд.Колонки.Добавить("ВыполняемоеДействие", ОписаниеСтроки);
	ТаблицаПонимаемыхКоманд.Колонки.Добавить("Описание", 			ОписаниеСтроки);
	ТаблицаПонимаемыхКоманд.Колонки.Добавить("Параметр", 			ОписаниеСтроки);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РолиTelegramКоманды.Команда.Наименование КАК Имя,
		|	РолиTelegramКоманды.Команда.ВыполняемоеДействие КАК ВыполняемоеДействие,
		|	РолиTelegramКоманды.Команда.Описание КАК Описание,
		|	РолиTelegramКоманды.Команда.Параметр КАК Параметр
		|ИЗ
		|	(ВЫБРАТЬ
		|		ПользователиРолиTelegram.Роль КАК Роль
		|	ИЗ
		|		Справочник.Пользователи.РолиTelegram КАК ПользователиРолиTelegram
		|	ГДЕ
		|		ПользователиРолиTelegram.Ссылка = &Пользователь) КАК Роли
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РолиTelegram.Команды КАК РолиTelegramКоманды
		|		ПО Роли.Роль = РолиTelegramКоманды.Ссылка
		|ГДЕ
		|	РолиTelegramКоманды.Команда.Выводить
		|
		|СГРУППИРОВАТЬ ПО
		|	РолиTelegramКоманды.Команда.Наименование,
		|	РолиTelegramКоманды.Команда.ВыполняемоеДействие,
		|	РолиTelegramКоманды.Команда.Описание,
		|	РолиTelegramКоманды.Команда.Параметр";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТаблицаПонимаемыхКоманд.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.ВыполняемоеДействие = НРег(Выборка.ВыполняемоеДействие);
		
		НоваяСтрока = ТаблицаПонимаемыхКоманд.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.ВыполняемоеДействие = НРег("/" + Выборка.ВыполняемоеДействие);
	КонецЦикла;
	
	Возврат ТаблицаПонимаемыхКоманд;
	
КонецФункции

// функция инициализирует выполнение понимаемых команд
//
Функция ВыполнитьКомандуБота(ЗаписьРегистра)
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ChatID", ЗаписьРегистра.chat_id);
	СтруктураПараметров.Вставить("Команда", ЗаписьРегистра.Команда);
	СтруктураПараметров.Вставить("Параметр", ЗаписьРегистра.Параметр);
	
	Если ЯвляетсяКомандойДляРегистрации(СтруктураПараметров.Команда) Тогда
		РегистрацияПользователя(СтруктураПараметров);
		Возврат Истина;
	КонецЕсли;
	
	Пользователь = ПолучитьПользовательПоChatID(СтруктураПараметров.ChatID);
	
	Если Не ЗначениеЗаполнено(Пользователь) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ЯвляетсяСтартовойКомандой(СтруктураПараметров.Команда) Тогда
		СтартовоеДействие(СтруктураПараметров, Пользователь);
		Возврат Истина;
	КонецЕсли;
	
	ТаблицаПонимаемыхКоманд = ПолучитьТаблицуПонимаемыхКоманд(Пользователь);
	
	МассивНайденныхСтрок = ТаблицаПонимаемыхКоманд.НайтиСтроки(Новый Структура("ВыполняемоеДействие", НРег(СтруктураПараметров.Команда)));
	
	Если МассивНайденныхСтрок.Количество() > 0 Тогда
		
		Для Каждого Стр Из МассивНайденныхСтрок Цикл
			
			Если Стр.ВыполняемоеДействие = "showlist" 
				Или Стр.ВыполняемоеДействие = "/showlist" Тогда
				
				ShowList(Пользователь, СтруктураПараметров.Параметр);
				
			ИначеЕсли Стр.ВыполняемоеДействие = "showwelcome"
				Или Стр.ВыполняемоеДействие = "/showwelcome" Тогда
				
				ShowWelcome(Пользователь, СтруктураПараметров.Параметр);
				
			ИначеЕсли Стр.ВыполняемоеДействие = "showfaq" 
				Или Стр.ВыполняемоеДействие = "/showfaq" Тогда
				
				ShowFAQ(Пользователь, СтруктураПараметров.Параметр);
				
			ИначеЕсли Стр.ВыполняемоеДействие = "showinfo"
				Или Стр.ВыполняемоеДействие = "/showinfo" Тогда
				
				ShowInfo(Пользователь, СтруктураПараметров.Параметр);
				
			ИначеЕсли Стр.ВыполняемоеДействие = "showfeedback"
				Или Стр.ВыполняемоеДействие = "/showfeedback" Тогда
				
				ShowFeedback(Пользователь, СтруктураПараметров.Параметр);
				
			ИначеЕсли Стр.ВыполняемоеДействие = "showlistdocs"
				Или Стр.ВыполняемоеДействие = "/showlistdocs" Тогда
				
				ВывестиСписокКомандГруппы(Пользователь, СтруктураПараметров.Параметр, Справочники.ГруппыКомандTelegram.Документы);
				
			ИначеЕсли Стр.ВыполняемоеДействие = "showlistadds"
				Или Стр.ВыполняемоеДействие = "/showlistadds" Тогда
				
				ВывестиСписокКомандГруппы(Пользователь, СтруктураПараметров.Параметр, Справочники.ГруппыКомандTelegram.Дополнительно);
				
			ИначеЕсли Стр.ВыполняемоеДействие = "showlisttasks"
				Или Стр.ВыполняемоеДействие = "/showlisttasks" Тогда
				
				ВывестиСписокКомандГруппы(Пользователь, СтруктураПараметров.Параметр, Справочники.ГруппыКомандTelegram.Задачи);
				
			ИначеЕсли Стр.ВыполняемоеДействие = "showlistreports"
				Или Стр.ВыполняемоеДействие = "/showlistreports" Тогда
				
				ВывестиСписокКомандГруппы(Пользователь, СтруктураПараметров.Параметр, Справочники.ГруппыКомандTelegram.Отчеты);
				
			ИначеЕсли Стр.ВыполняемоеДействие = "showlistsettings"
				Или Стр.ВыполняемоеДействие = "/showlistsettings" Тогда
				
				ВывестиСписокКомандГруппы(Пользователь, СтруктураПараметров.Параметр, Справочники.ГруппыКомандTelegram.Настройки);
				
			ИначеЕсли Стр.ВыполняемоеДействие = "docsmy"
				Или Стр.ВыполняемоеДействие = "/docsmy" Тогда
				
				DocsMy(Пользователь, СтруктураПараметров);
				
			ИначеЕсли Стр.ВыполняемоеДействие = "docsnew"
				Или Стр.ВыполняемоеДействие = "/docsnew" Тогда
				
				DocsNew(Пользователь, СтруктураПараметров);
				
			ИначеЕсли Стр.ВыполняемоеДействие = "docsonappr"
				Или Стр.ВыполняемоеДействие = "/docsonappr" Тогда
				
				DocsOnAppr(Пользователь, СтруктураПараметров);
				
			ИначеЕсли Стр.ВыполняемоеДействие = "docsinfo"
				Или Стр.ВыполняемоеДействие = "/docsinfo" Тогда
				
				DocsInfo(Пользователь, СтруктураПараметров);
				
			ИначеЕсли Стр.ВыполняемоеДействие = "docsinfotext"
				Или Стр.ВыполняемоеДействие = "/docsinfotext" Тогда
				
				DocsInfoText(Пользователь, СтруктураПараметров);
				
			ИначеЕсли Стр.ВыполняемоеДействие = "docsnewmonth"
				Или Стр.ВыполняемоеДействие = "/docsnewmonth" Тогда
				
				DocsNewMonth(Пользователь, СтруктураПараметров);
				
			ИначеЕсли Стр.ВыполняемоеДействие = "docsprevmonth"
				Или Стр.ВыполняемоеДействие = "/docsprevmonth" Тогда
				
				DocsPrevMonth(Пользователь, СтруктураПараметров);
				
			ИначеЕсли Стр.ВыполняемоеДействие = "tasksmy"
				Или Стр.ВыполняемоеДействие = "/tasksmy" Тогда
				
				TasksMy(Пользователь, СтруктураПараметров);
				
			ИначеЕсли Стр.ВыполняемоеДействие = "tasksissued"
				Или Стр.ВыполняемоеДействие = "/tasksissued" Тогда
				
				TasksIssued(Пользователь, СтруктураПараметров);
				
			ИначеЕсли Стр.ВыполняемоеДействие = "statisticall"
				Или Стр.ВыполняемоеДействие = "/statisticall" Тогда
				
				StatisticAll(Пользователь, СтруктураПараметров);
				
			Иначе
				
				ВывестиОшибку(Пользователь, СтруктураПараметров.Параметр);
				
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		
		ВывестиОшибку(Пользователь, СтруктураПараметров.Параметр);
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Функция возращяет параметры клавиатуры для сообщения
//
Функция ПолучитьКлавиатуру(МассивКнопок)
	
	ПутьКФайлу = ПолучитьИмяВременногоФайла("txt");
	
	Структура = Новый Структура;
	Структура.Вставить("inline_keyboard", МассивКнопок);
	Структура.Вставить("one_time_keyboard" , Истина);
	Структура.Вставить("resize_keyboard", Истина);
	
	Файл = Новый ТекстовыйДокумент;
	Файл.Записать(ПутьКФайлу, "UTF-8");
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ОткрытьФайл(ПутьКФайлу);
	ЗаписатьJSON(ЗаписьJSON, Структура);
	ЗаписьJSON.Закрыть();
	
	Файл.Прочитать(ПутьКФайлу, "UTF-8");
	
	ТекстJSON = Файл.ПолучитьТекст();
	ТекстJSON = СтрЗаменить(ТекстJSON, "Истина", "True");
	
	Возврат ТекстJSON;
	
КонецФункции

// Функция возращяет параметры закрытие клавиатуры для сообщения
//
Функция ПолучитьЗакрытуюКлавиатуру()
	
	ПутьКФайлу = ПолучитьИмяВременногоФайла("txt");
	
	Структура = Новый Структура;
	Структура.Вставить("remove_keyboard" , Истина);
	
	Файл = Новый ТекстовыйДокумент;
	Файл.Записать(ПутьКФайлу, "UTF-8");
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ОткрытьФайл(ПутьКФайлу);
	ЗаписатьJSON(ЗаписьJSON, Структура);
	ЗаписьJSON.Закрыть();
	
	Файл.Прочитать(ПутьКФайлу, "UTF-8");
	
	ТекстJSON = Файл.ПолучитьТекст();
	ТекстJSON = СтрЗаменить(ТекстJSON, "Истина", "True");
	
	Возврат ТекстJSON;
	
КонецФункции

// Функция проверяет команду на соответствие регистрационным командам
//
Функция ЯвляетсяКомандойДляРегистрации(Команда)
	
	СписокКоманда = Новый СписокЗначений;
	СписокКоманда.Добавить("/regmail");
	СписокКоманда.Добавить("/regpass");
	
	Если СписокКоманда.НайтиПоЗначению(НРег(Команда)) <> Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

// Функция проверяет команду на соответствие стартовым командам
//
Функция ЯвляетсяСтартовойКомандой(Команда)
	
	СписокКоманда = Новый СписокЗначений;
	СписокКоманда.Добавить("/start");
	
	Если СписокКоманда.НайтиПоЗначению(НРег(Команда)) <> Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

// Процедура регистрации нового пользователя в telegram-боте
//
Процедура РегистрацияПользователя(СтруктураПараметров)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИСТИНА
		|ИЗ
		|	РегистрСведений.ПодключенияTelegram КАК ПодключенияTelegram
		|ГДЕ
		|	ПодключенияTelegram.chat_id = &chat_id
		|	И ПодключенияTelegram.Актуальность
		|	И ПодключенияTelegram.АутентификацияПройдена";
	
	Запрос.УстановитьПараметр("chat_id", СтруктураПараметров.ChatID);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		ТекстСообщения = "Текущий пользователь активный. Регистрация не нужна.";
		ОтправитьСообщениеTelegramПоChatID(СтруктураПараметров.ChatID, ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Если НРег(СтруктураПараметров.Команда) = "/regmail" Тогда 
		
		Если Не ЗначениеЗаполнено(СтруктураПараметров.Параметр) Тогда
			
			ТекстСообщения = "Не верно указана почта.
			|Для этого необходимо отправить команду /RegMail и указать корпоративную почту.
			|Пример команды: /RegMail v.pupkin@brsm-nafta.com";
			
			ОтправитьСообщениеTelegramПоChatID(СтруктураПараметров.ChatID, ТекстСообщения);
			Возврат;
			
		КонецЕсли;
		
		Запись = РегистрыСведений.ИсторияРегистрацииTelegram.СоздатьМенеджерЗаписи();
		Запись.Период = ТекущаяДата();
		Запись.chat_id = СтруктураПараметров.ChatID;
		Запись.СобытиеРегистрации = Перечисления.СобытияРегистрацииTelegram.НачалоРегистрации;
		Запись.Команда = СтруктураПараметров.Команда;
		Запись.Параметр = СтруктураПараметров.Параметр;
		Запись.Пользователь = Справочники.Пользователи.ПустаяСсылка();
		
		Запись.Записать();
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ПользователиКонтактнаяИнформация.Ссылка КАК Пользователь
		               |ИЗ
		               |	Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация
		               |ГДЕ
		               |	ПользователиКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
		               |	И ПользователиКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailПользователя)
		               |	И ПользователиКонтактнаяИнформация.Представление = &Почта";
		
		Запрос.УстановитьПараметр("Почта", СтруктураПараметров.Параметр);
		
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		
		Количество = Выборка.Количество();
		Если Количество = 0 Тогда
			
			Запись = РегистрыСведений.ИсторияРегистрацииTelegram.СоздатьМенеджерЗаписи();
			Запись.Период = ТекущаяДата();
			Запись.chat_id = СтруктураПараметров.ChatID;
			Запись.СобытиеРегистрации = Перечисления.СобытияРегистрацииTelegram.НевернаяПочта;
			Запись.Команда = СтруктураПараметров.Команда;
			Запись.Параметр = СтруктураПараметров.Параметр;
			Запись.Пользователь = Справочники.Пользователи.ПустаяСсылка();
			
			ТекстСообщения = "Почта не найдена в корпоративной базе.
			|Обратитесь к администратору системы";
			
			ОтправитьСообщениеTelegramПоChatID(СтруктураПараметров.ChatID, ТекстСообщения);
			Возврат;
			
		ИначеЕсли Количество = 1 Тогда
			
			Выборка.Следующий();
			
			Запись = РегистрыСведений.ИсторияРегистрацииTelegram.СоздатьМенеджерЗаписи();
			Запись.Период = ТекущаяДата();
			Запись.chat_id = СтруктураПараметров.ChatID;
			Запись.СобытиеРегистрации = Перечисления.СобытияРегистрацииTelegram.НайденаПочта;
			Запись.Команда = СтруктураПараметров.Команда;
			Запись.Параметр = СтруктураПараметров.Параметр;
			Запись.Пользователь = Выборка.Пользователь;
			
			Запись.Записать();
			
			// Отправка письма с инструкцией
			УчетнаяЗапись = Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоНаименованию("Системная учетная запись");
			
			ПараметрыПисьма = Новый Структура;
			СписокФайлов = Новый Массив;
			
			Пароль = Формат(Выборка.Пользователь.ПарольTelegram, "ЧЦ=6; ЧДЦ=; ЧГ=");
			
			Текст = "Добрый день,
			|
			|Ваш секретный код: " + Пароль + "
			|Для продолжения активации учетной записи для работы с telegram-бот необходимо
			|отправить в telegram:
			|
			|/RegPass " + Пароль + "
			|
			|Это информационное письмо. На него не нужно отвечать!";
			
			ПараметрыПисьма.Вставить("УчетнаяЗапись", УчетнаяЗапись);
			ПараметрыПисьма.Вставить("Кому", СтруктураПараметров.Параметр);
			ПараметрыПисьма.Вставить("Тема", "Регистрация в Telegram для 1С:Документооборот");
			ПараметрыПисьма.Вставить("Тело", Текст);
			ПараметрыПисьма.Вставить("Вложения", СписокФайлов);
			
			РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(УчетнаяЗапись, ПараметрыПисьма);
			
			ТекстСообщения = "На корпоративную почту было отправлено письмо с продолжением регистрации.
			|Если в течении 5 минут письмо не пришло, то обратитесь к администратору системы";
			
			ОтправитьСообщениеTelegramПоChatID(СтруктураПараметров.ChatID, ТекстСообщения);
			
			Запись = РегистрыСведений.ИсторияРегистрацииTelegram.СоздатьМенеджерЗаписи();
			Запись.Период = ТекущаяДата()+1;
			Запись.chat_id = СтруктураПараметров.ChatID;
			Запись.СобытиеРегистрации = Перечисления.СобытияРегистрацииTelegram.ОтправкаПисьмаСПаролем;
			Запись.Команда = СтруктураПараметров.Команда;
			Запись.Параметр = Пароль;
			Запись.Пользователь = Выборка.Пользователь;
			
			Запись.Записать();
			
		ИначеЕсли Количество > 1 Тогда
			
			Запись = РегистрыСведений.ИсторияРегистрацииTelegram.СоздатьМенеджерЗаписи();
			Запись.Период = ТекущаяДата();
			Запись.chat_id = СтруктураПараметров.ChatID;
			Запись.СобытиеРегистрации = Перечисления.СобытияРегистрацииTelegram.ДублированиеПочты;
			Запись.Команда = СтруктураПараметров.Команда;
			Запись.Параметр = СтруктураПараметров.Параметр;
			Запись.Пользователь = Справочники.Пользователи.ПустаяСсылка();
			
			Запись.Записать();
			
			ТекстСообщения = "Найдено несколько пользователей с текущей почтой.
			|Обратитесь к администратору системы";
			
			ОтправитьСообщениеTelegramПоChatID(СтруктураПараметров.ChatID, ТекстСообщения);
			Возврат;
			
		КонецЕсли;
		
	ИначеЕсли НРег(СтруктураПараметров.Команда) = "/regpass" Тогда
		
		Если СтруктураПараметров.Параметр = "" Тогда
			
			Запись = РегистрыСведений.ИсторияРегистрацииTelegram.СоздатьМенеджерЗаписи();
			Запись.Период = ТекущаяДата();
			Запись.chat_id = СтруктураПараметров.ChatID;
			Запись.СобытиеРегистрации = Перечисления.СобытияРегистрацииTelegram.НеверныйПароль;
			Запись.Команда = СтруктураПараметров.Команда;
			Запись.Параметр = СтруктураПараметров.Параметр;
			Запись.Пользователь = Справочники.Пользователи.ПустаяСсылка();
			
			Запись.Записать();
			
			ТекстСообщения = "Укажите секретный код, который был выслан на почту.";
			ОтправитьСообщениеTelegramПоChatID(СтруктураПараметров.ChatID, ТекстСообщения);
			Возврат;
			
		Иначе
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ИсторияРегистрацииTelegramСрезПоследних.Пользователь,
			|	ИсторияРегистрацииTelegramСрезПоследних.Параметр КАК Пароль
			|ИЗ
			|	РегистрСведений.ИсторияРегистрацииTelegram.СрезПоследних(
			|			,
			|			chat_id = &chat_id
			|				И СобытиеРегистрации = &СобытиеРегистрации) КАК ИсторияРегистрацииTelegramСрезПоследних";
			
			Запрос.УстановитьПараметр("chat_id", СтруктураПараметров.ChatID);
			Запрос.УстановитьПараметр("СобытиеРегистрации", Перечисления.СобытияРегистрацииTelegram.ОтправкаПисьмаСПаролем);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			Выборка = РезультатЗапроса.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				Пароль = Выборка.Пароль;
			КонецЦикла;
			
			Если Пароль = СтруктураПараметров.Параметр Тогда
				
				Запись = РегистрыСведений.ИсторияРегистрацииTelegram.СоздатьМенеджерЗаписи();
				Запись.Период = ТекущаяДата();
				Запись.chat_id = СтруктураПараметров.ChatID;
				Запись.СобытиеРегистрации = Перечисления.СобытияРегистрацииTelegram.ОкончаниеРегистрации;
				Запись.Команда = СтруктураПараметров.Команда;
				Запись.Параметр = СтруктураПараметров.Параметр;
				Запись.Пользователь = Выборка.Пользователь;
				
				Запись.Записать();
				
				ТекстСообщения = "Регистрация завершена успешно. Для начала работы нажмите /start";
				ОтправитьСообщениеTelegramПоChatID(СтруктураПараметров.ChatID, ТекстСообщения);
				
				НаборЗаписей = РегистрыСведений.ПодключенияTelegram.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Пользователь.Установить(Выборка.Пользователь);
				НаборЗаписей.Отбор.chat_id.Установить(СтруктураПараметров.ChatID);
				НаборЗаписей.Прочитать();
				НаборЗаписей.Очистить();
				
				Запись = НаборЗаписей.Добавить();
				Запись.Пользователь = Выборка.Пользователь;
				Запись.chat_id = СтруктураПараметров.ChatID;
				Запись.Актуальность = Истина;
				Запись.АутентификацияПройдена = Истина;
				
				НаборЗаписей.Записать();
				
				Возврат;
				
			Иначе
				
				Запись = РегистрыСведений.ИсторияРегистрацииTelegram.СоздатьМенеджерЗаписи();
				Запись.Период = ТекущаяДата();
				Запись.chat_id = СтруктураПараметров.ChatID;
				Запись.СобытиеРегистрации = Перечисления.СобытияРегистрацииTelegram.НеверныйПароль;
				Запись.Команда = СтруктураПараметров.Команда;
				Запись.Параметр = СтруктураПараметров.Параметр;
				Запись.Пользователь = Справочники.Пользователи.ПустаяСсылка();
				
				Запись.Записать();
				
				ТекстСообщения = "Указан неверный секретный код.";
				ОтправитьСообщениеTelegramПоChatID(СтруктураПараметров.ChatID, ТекстСообщения);
				Возврат;
				
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

// Процедура вывода клавиатры с стартовыми действиями в telegram-боте
//
Процедура СтартовоеДействие(СтруктураПараметров, Пользователь)
	
	ShowList(Пользователь, СтруктураПараметров.Параметр);
	
КонецПроцедуры

// Процедура отправки сообщения об ошибке в telegram-боте
//
Процедура ВывестиОшибку(Пользователь, Параметр)
	
	ТекстСообщения = "Ошибка! Команда не найдена. Для начала работы необходимо ввести команду /start";
	ОтправитьСообщениеTelegram(Пользователь, ТекстСообщения);
	
КонецПроцедуры

// Процедура вывода списока команд группы в telegram-боте
//
Процедура ВывестиСписокКомандГруппы(Пользователь, Параметр, Группа)
	
	ОсновнойМассив = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ГруппыКомандTelegramКоманды.Команда.Описание КАК Описание,
	|	ГруппыКомандTelegramКоманды.Команда.ВыполняемоеДействие КАК ВыполняемоеДействие,
	|	ГруппыКомандTelegramКоманды.Команда.Параметр КАК Параметр
	|ИЗ
	|	Справочник.ГруппыКомандTelegram.Команды КАК ГруппыКомандTelegramКоманды
	|ГДЕ
	|	ГруппыКомандTelegramКоманды.Команда В
	|			(ВЫБРАТЬ
	|				РолиTelegramКоманды.Команда
	|			ИЗ
	|				Справочник.РолиTelegram.Команды КАК РолиTelegramКоманды
	|			ГДЕ
	|				РолиTelegramКоманды.Ссылка В
	|					(ВЫБРАТЬ
	|						ПользователиРолиTelegram.Роль
	|					ИЗ
	|						Справочник.Пользователи.РолиTelegram КАК ПользователиРолиTelegram
	|					ГДЕ
	|						ПользователиРолиTelegram.Ссылка = &Пользователь)
	|			СГРУППИРОВАТЬ ПО
	|				РолиTelegramКоманды.Команда)
	|	И ГруппыКомандTelegramКоманды.Ссылка = &Группа
	|
	|УПОРЯДОЧИТЬ ПО
	|	ГруппыКомандTelegramКоманды.НомерСтроки";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("Группа", Группа);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		МассивКнопок = Новый Массив();
		МассивКнопок.Добавить(Новый Структура("text, callback_data", Выборка.Описание, СокрЛП(Выборка.ВыполняемоеДействие + " " + Выборка.Параметр)));
		ОсновнойМассив.Добавить(МассивКнопок);
	КонецЦикла;
	
	Клавиатура = ПолучитьКлавиатуру(ОсновнойМассив);
	
	ТекстСообщения = "Выберете действие:";
	ОтправитьСообщениеTelegram(Пользователь, ТекстСообщения,,,,Клавиатура);
	
КонецПроцедуры

Процедура ПолучитьОтчетПоКоманде(ИмяКоманды, Пользователь, СтруктураПараметров)
	
	ХранилищеВнешнихМакетов = ЯЯ_ВзаимодействиеССервисами.ПолучитьПредопределенныйОбъект("ХранилищеВнешнихМакетов");
	ОбъектВнешнейОбработки = ДополнительныеОтчетыИОбработки.ПолучитьОбъектВнешнейОбработки(ХранилищеВнешнихМакетов);
	
	ДокументРезультат = Неопределено;
	
	Если ИмяКоманды = "DocsMy" Тогда
		ДокументРезультат = ОбъектВнешнейОбработки.ПолучитьТабличныйДокумент_DocsMy(Пользователь);
	ИначеЕсли ИмяКоманды = "DocsNew" Тогда
		ДокументРезультат = ОбъектВнешнейОбработки.ПолучитьТабличныйДокумент_DocsNew(Пользователь);
	ИначеЕсли ИмяКоманды = "DocsOnAppr" Тогда
		ДокументРезультат = ОбъектВнешнейОбработки.ПолучитьТабличныйДокумент_DocsOnAppr(Пользователь);
	ИначеЕсли ИмяКоманды = "DocsInfo" Тогда
		ДокументРезультат = ОбъектВнешнейОбработки.ПолучитьТабличныйДокумент_DocsInfo(Пользователь, СтруктураПараметров.Параметр);
	ИначеЕсли ИмяКоманды = "DocsNewMonth" Тогда
		ДокументРезультат = ОбъектВнешнейОбработки.ПолучитьТабличныйДокумент_DocsNewMonth(Пользователь);
	ИначеЕсли ИмяКоманды = "DocsPrevMonth" Тогда
		ДокументРезультат = ОбъектВнешнейОбработки.ПолучитьТабличныйДокумент_DocsPrevMonth(Пользователь);
	ИначеЕсли ИмяКоманды = "TasksMy" Тогда
		ДокументРезультат = ОбъектВнешнейОбработки.ПолучитьТабличныйДокумент_TasksMy(Пользователь);
	ИначеЕсли ИмяКоманды = "TasksIssued" Тогда
		ДокументРезультат = ОбъектВнешнейОбработки.ПолучитьТабличныйДокумент_TasksIssued(Пользователь);
	ИначеЕсли ИмяКоманды = "StatisticAll" Тогда
		ДокументРезультат = ОбъектВнешнейОбработки.ПолучитьТабличныйДокумент_StatisticAll(Пользователь);
	КонецЕсли;
		
	Если ДокументРезультат = Неопределено Тогда
		ТекстСообщения = "Нет данных для вывода.";
		ОтправитьСообщениеTelegram(Пользователь, ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ИмяФайла = ПолучитьИмяВременногоФайла("PDF");
	ДокументРезультат.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.PDF);
	
	Параметр = Новый Структура;
	Параметр.Вставить("Пользователь", Пользователь);
	Параметр.Вставить("ИмяФайла", ИмяФайла);
	Параметр.Вставить("НазваниеФайла", ИмяКоманды + "_" + Формат(ТекущаяДата(), "ДФ=yyyy-MM-dd_HH-mm-ss"));
	
	ОтправитьФайл(Пользователь, СтруктураПараметров.ChatID, Параметр);
	
	ТекстСообщения = "Для подолжения работы нажмите /start";
	ОтправитьСообщениеTelegram(Пользователь, ТекстСообщения);
	
КонецПроцедуры

////////////////////////////////////////////////////////
// СТАРТОВАЯ ГРУППА

Процедура ShowWelcome(Пользователь, Параметр)
	
	ТекстСообщения = "Добро пожаловать в telegram-бот для работы с СЭД:Документооборотом! Буду рад помочь в работе с корпоративными документами.";
	ОтправитьСообщениеTelegram(Пользователь, ТекстСообщения);
	
	ТекстСообщения = "Для подолжения работы нажмите /start";
	ОтправитьСообщениеTelegram(Пользователь, ТекстСообщения);
	
КонецПроцедуры

Процедура ShowList(Пользователь, Параметр)
	
	ОсновнойМассив = Новый Массив;
	МассивКнопок = Новый Массив();
	
	СписокНедоступныхГрупп = Новый СписокЗначений;
	СписокНедоступныхГрупп.Добавить(Справочники.ГруппыКомандTelegram.ОбщаяГруппа);
	
	Ид = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ГруппыКоманд.ГруппаКоманд,
	|	ГруппыКоманд.ВыполняемоеДействие,
	|	ГруппыКоманд.Параметр
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПРЕДСТАВЛЕНИЕССЫЛКИ(ГруппыКомандTelegramКоманды.Ссылка) КАК ГруппаКоманд,
	|		ГруппыКомандTelegramКоманды.Ссылка.Команда.ВыполняемоеДействие КАК ВыполняемоеДействие,
	|		ГруппыКомандTelegramКоманды.Ссылка.Команда.Параметр КАК Параметр,
	|		ГруппыКомандTelegramКоманды.Ссылка.Порядок КАК Порядок
	|	ИЗ
	|		Справочник.ГруппыКомандTelegram.Команды КАК ГруппыКомандTelegramКоманды
	|	ГДЕ
	|		ГруппыКомандTelegramКоманды.Команда В
	|				(ВЫБРАТЬ
	|					РолиTelegramКоманды.Команда
	|				ИЗ
	|					Справочник.РолиTelegram.Команды КАК РолиTelegramКоманды
	|				ГДЕ
	|					РолиTelegramКоманды.Ссылка В
	|						(ВЫБРАТЬ
	|							ПользователиРолиTelegram.Роль
	|						ИЗ
	|							Справочник.Пользователи.РолиTelegram КАК ПользователиРолиTelegram
	|						ГДЕ
	|							ПользователиРолиTelegram.Ссылка = &Пользователь)
	|					И РолиTelegramКоманды.Команда.Выводить
	|				СГРУППИРОВАТЬ ПО
	|					РолиTelegramКоманды.Команда)
	|		И НЕ ГруппыКомандTelegramКоманды.Ссылка В (&СписокНедоступныхГрупп)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ГруппыКомандTelegramКоманды.Ссылка.Команда.ВыполняемоеДействие,
	|		ГруппыКомандTelegramКоманды.Ссылка.Команда.Параметр,
	|		ГруппыКомандTelegramКоманды.Ссылка.Порядок,
	|		ПРЕДСТАВЛЕНИЕССЫЛКИ(ГруппыКомандTelegramКоманды.Ссылка)) КАК ГруппыКоманд
	|
	|УПОРЯДОЧИТЬ ПО
	|	ГруппыКоманд.Порядок";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("СписокНедоступныхГрупп", СписокНедоступныхГрупп);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Ид = Ид + 1;
		Если Ид > 3 Тогда
			ОсновнойМассив.Добавить(МассивКнопок);
			МассивКнопок = Новый Массив;
			Ид = 1;
		КонецЕсли;
		
		МассивКнопок.Добавить(Новый Структура("text, callback_data", Выборка.ГруппаКоманд, СокрЛП(Выборка.ВыполняемоеДействие + " " + Выборка.Параметр)));
		
	КонецЦикла;
	
	ОсновнойМассив.Добавить(МассивКнопок);
	Клавиатура = ПолучитьКлавиатуру(ОсновнойМассив);
	
	ТекстСообщения = "Выберете действие:";
	ОтправитьСообщениеTelegram(Пользователь, ТекстСообщения,,,,Клавиатура);
	
КонецПроцедуры

Процедура ShowFAQ(Пользователь, Параметр)
	
	ТекстСообщения = "Упс...команда в процессе разработки.";
	ОтправитьСообщениеTelegram(Пользователь, ТекстСообщения);
	
	ТекстСообщения = "Для подолжения работы нажмите /start";
	ОтправитьСообщениеTelegram(Пользователь, ТекстСообщения);
	
КонецПроцедуры

Процедура ShowInfo(Пользователь, Параметр)
	
	Почта = "";
	Статус = "";
	Роли = "";
	
	УстановитьПривилегированныйРежим(Истина);
	ПользовательИБ=ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(Пользователь.ИдентификаторПользователяИБ);
	УстановитьПривилегированныйРежим(Ложь);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПользователиКонтактнаяИнформация.Представление КАК Почта
	               |ИЗ
	               |	Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация
	               |ГДЕ
	               |	ПользователиКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
	               |	И ПользователиКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailПользователя)
	               |	И ПользователиКонтактнаяИнформация.Ссылка = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		Почта = Выборка.Почта;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПРЕДСТАВЛЕНИЕ(ПользователиРолиTelegram.Роль) КАК Роль
		|ИЗ
		|	Справочник.Пользователи.РолиTelegram КАК ПользователиРолиTelegram
		|ГДЕ
		|	ПользователиРолиTelegram.Ссылка = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Роли = Роли + Выборка.Роль + "; ";
	КонецЦикла;
	
	Статус = ?(Пользователь.Недействителен, "Не активный", "Активный");
	
	ТекстСообщения = "О пользователе:
					 |Логин: " + ПользовательИБ.Имя + "
					 |Пользователь: " + ПользовательИБ.ПолноеИмя + "
					 |Почта: " + Почта + "
					 |Статус: " + Статус + "
					 |Роли: " + Роли;
	ОтправитьСообщениеTelegram(Пользователь, ТекстСообщения);
	
	ТекстСообщения = "О программе:
					 |Версия бота: 2.0.1.
					 |Версия конфигурации: 5.0.2.5-161112
					 |Разработчик: Пилипчук Дмитрий Сергеевич
					 |Skype: Noxie41";
	ОтправитьСообщениеTelegram(Пользователь, ТекстСообщения);
	
	ТекстСообщения = "Для подолжения работы нажмите /start";
	ОтправитьСообщениеTelegram(Пользователь, ТекстСообщения);
	
КонецПроцедуры

Процедура ShowFeedback(Пользователь, Параметр)
	
	ТекстСообщения = "Все замечания и предложения по работе telegram-бота прошу отправлять на почту: d.pylypchuk@brsm-nafta.com";
	ОтправитьСообщениеTelegram(Пользователь, ТекстСообщения);
	
	ТекстСообщения = "Для подолжения работы нажмите /start";
	ОтправитьСообщениеTelegram(Пользователь, ТекстСообщения);
	
КонецПроцедуры


////////////////////////////////////////////////////////
// ДОКУМЕНТЫ

Процедура DocsMy(Пользователь, СтруктураПараметров)
	ПолучитьОтчетПоКоманде("DocsMy" ,Пользователь, СтруктураПараметров);
КонецПроцедуры

Процедура DocsNew(Пользователь, СтруктураПараметров)
	ПолучитьОтчетПоКоманде("DocsNew" ,Пользователь, СтруктураПараметров);
КонецПроцедуры

Процедура DocsOnAppr(Пользователь, СтруктураПараметров)
	ПолучитьОтчетПоКоманде("DocsOnAppr" ,Пользователь, СтруктураПараметров);
КонецПроцедуры

Процедура DocsInfo(Пользователь, СтруктураПараметров)
	ПолучитьОтчетПоКоманде("DocsInfo" ,Пользователь, СтруктураПараметров);
КонецПроцедуры

Процедура DocsInfoText(Пользователь, СтруктураПараметров)
	
	ТекстСообщения = "Для получения информации по документу необходимо ввести команду /DocsInfo ХХ-ХХХХХ-ХХХХ, где XX-XXXXX-XXXX - номер корпоративного документа. Пример: /DocsInfo ДН-00001-2020";
	ОтправитьСообщениеTelegram(Пользователь, ТекстСообщения);
	
КонецПроцедуры

/////////////////////////////////////////////////////////
// ЗАДАЧИ

Процедура TasksMy(Пользователь, СтруктураПараметров)
	ПолучитьОтчетПоКоманде("TasksMy" ,Пользователь, СтруктураПараметров);
КонецПроцедуры

Процедура TasksIssued(Пользователь, СтруктураПараметров)
	ПолучитьОтчетПоКоманде("TasksIssued" ,Пользователь, СтруктураПараметров);
КонецПроцедуры

/////////////////////////////////////////////////////////
// ОТЧЕТЫ

Процедура DocsNewMonth(Пользователь, СтруктураПараметров)
	ПолучитьОтчетПоКоманде("DocsNewMonth" ,Пользователь, СтруктураПараметров);
КонецПроцедуры

Процедура DocsPrevMonth(Пользователь, СтруктураПараметров)
	ПолучитьОтчетПоКоманде("DocsPrevMonth" ,Пользователь, СтруктураПараметров);
КонецПроцедуры

/////////////////////////////////////////////////////////
// СТАТИСТИКА

Процедура StatisticAll(Пользователь, СтруктураПараметров)
	ПолучитьОтчетПоКоманде("StatisticAll" ,Пользователь, СтруктураПараметров);
КонецПроцедуры









